[
  {
    "Tags": [
      "NegativeStatusEffect",
      "Slow"
    ],
    "Name": "Wired Inhibitor",
    "Description": "Applying a Negative Status Effect on an enemy also applies SLOW for 1s. Applying or  refreshing additional Negative Statuses will increase the duration by 1s. Max 5s.",
    "Location": "Can be crafted at Spark, you will need the following Materials: x1 House Lythla Glyph, x25 Alien Alloy."
  },
  {
    "Tags": [
      "OnRelicUse",
      "CriticalChance",
      "CriticalDamage"
    ],
    "Name": "Transient Cord",
    "Description": "On Relic Use, increases Critical Chance by 10% and Critical Damage by 10% for 15s. Reduce bonus by 1% once every 1.5s. ",
    "Location": "Can be found in the Agronomy Sector, lying on the ground in a wide-open area."
  },
  {
    "Tags": [
      "LowHealth",
      "Shield",
      "GreyHealth"
    ],
    "Name": "Disaster Converter",
    "Description": "When wearer's Health drops below 25%, gain a SHIELD for 50% of total current Grey Health for 10s. Max 50% SHIELD. Does not stack with itself.",
    "Location": "Can be found at the beginning of The Dark Horizon DLC. It will spawn a while after the cart crash."
  },
  {
    "Tags": [
      "GreyHealth"
    ],
    "Name": "Ring Of Phantom Pain",
    "Description": "Missing Health is converted to 10 Grey Health per second. Reduces Grey Health Regeneration by 90%",
    "Location": "Can be bought by Reggie in Ward 13."
  },
  {
    "Tags": [
      "MovementSpeed",
      "PhysicalDamage",
      "Haste"
    ],
    "Name": "Breach Accelerator",
    "Description": "Increases Movement Speed and Physical Damage by 5%. Bonus is doubled when HASTE is active",
    "Location": "As soon as you enter the Agronomy Sector, in The Dark Horizon DLC. You will find this ring guarded by an enemy."
  },
  {
    "Tags": [
      "ExplosiveDamage"
    ],
    "Name": "Burden of the Excavator",
    "Description": "Explosions cannot Critical Hit. Increases Explosive Damage by 35%",
    "Location": "Complete Logistics Bridge it's at the End"
  },
  {
    "Tags": [
      "Shield"
    ],
    "Name": "Burden of the Protector",
    "Description": "Reduces incoming SHIELD Duration by 50%. Increases SHIELD Amount by 15%",
    "Location": "Complete the Stealth Event on your first try, without firing alarm once. After first alarm 2nd door closes forever (for that save). You can reset at stone, but then you can only get 1st reward."
  },
  {
    "Tags": [
      "OnPerfectDodge",
      "Reload"
    ],
    "Name": "Bypass Primer",
    "Description": "On Perfect Dodge, reload current Firearm",
    "Location": "Can be found in N'erud, players have to complete the Stealth event."
  },
  {
    "Tags": [
      "Shield"
    ],
    "Name": "Clear Halo",
    "Description": "After 10s of not being damaged, generate a SHIELD for 10% of Max Health over 2s.",
    "Location": "This ring can be found at the end of the final room in the Athenaeum Wek. After entering the final room, take the right elevator to the second floor and jump the gap.Take the furthest lit tile down a slight ways to pick up the House Wek Command Orb.Climb the room until you reach the top, then put the orb into the pedestal to the right of the terminal.Upon killing the boss and collecting the Insulator, go to the right from the terminal and go down the walkway and the Clear Halo will be on a pedestal."
  },
  {
    "Tags": [
      "Other"
    ],
    "Name": "Combat Shield Generator",
    "Description": "While in combat, Crouching or Combat Slide generates a stationary 3m x 1.5m Energy Shield with 300 Health which blocks enemy projectiles. Lasts 10s or until broken by damage. Can only happen once every 10s after expiring.",
    "Location": "Inside Mucid Terrarium there is a large sealed door with a cable to the right of it, shoot the cable with Enigma and the door will open, kill the enemies, find another cable in the room and shoot it with enigma, the door that opens will have this ring inside."
  },
  {
    "Tags": [
      "Armor",
      "Shield"
    ],
    "Name": "Custodian's Bastion",
    "Description": "Increases Armor by 1 per 2% of active SHIELD. Max 100 Bonus Armor.",
    "Location": "Withered Necropolis (N'erud);Exclusive to The Dark Horizon DLC;Talk to The Gardener after defeating Alepsis-Taura to learn more about the Dryzr and himself. After the conversation, the ring will be on the ground for you to pick up."
  },
  {
    "Tags": [
      "UnarmedAttack",
      "Explosive",
      "ExplosiveDamage",
      "ChargedMeleeAttack"
    ],
    "Name": "Demolition Coil",
    "Description": "Unarmed Charged Melee Attacks explode when hitting an Enemy, dealing 30% additional Explosive Damage over 1.5m",
    "Location": "N'erud random drop. (This drop is completely random and can appear anywhere in N'erud or its dungeons)"
  },
  {
    "Tags": [
      "OnRelicUse",
      "Explosive",
      "ExplosiveDamage"
    ],
    "Name": "Detonating Cord",
    "Description": "On Relic Use, increases Explosive Damage by 10% for 15s and casts a 3m Explosive AOE which deals 100 Base Damage.",
    "Location": "N'erud world drop. (This drop is completely random and can appear anywhere in N'erud or its dungeons)"
  },
  {
    "Tags": [
      "RangedDamage"
    ],
    "Name": "Empowering Loop",
    "Description": "Increases Ranged Damage by 15%. Slows Firearm Charge Time by 10% and reduces Fire Rate by 10%. ",
    "Location": "It can be found as a random drop on Yaesha."
  },
  {
    "Tags": [
      "ConsumableUseSpeed",
      "RelicUseSpeed"
    ],
    "Name": "Feeding Tube",
    "Description": "While in combat, auto-consume the compatible item in the first quick-slot every 30s: Increases Consumable and Relic Use Speed by 10%. Not compatible with Concoctions, Grenades and some Unique Consumables.",
    "Location": "A random world drop in N'Erud. (World drops are completely random and can appear anywhere in the world or its dungeons)"
  },
  {
    "Tags": [
      "WeaponDamage",
      "ChargedAttack"
    ],
    "Name": "Force Multiplier",
    "Description": "Overcharging Charge Weapons grants 1.05x Weapon Damage Per 0.5s while Charge is held beyond Perfect Release Window. Max 1.3x.",
    "Location": "Can be crafted at Spark, you will need the following Materials: x1 Decorum Cipher and x25 Alien Alloy"
  },
  {
    "Tags": [
      "AllDamage"
    ],
    "Name": "Impact Augment",
    "Description": "When a single source of Enemy Damage exceeds 15% of Max Health, increases All Damage dealt by 3% for 10s. Max 5 stacks.",
    "Location": "A random world drop in N'Erud. (World drops are completely random and can appear anywhere in the world or its dungeons)"
  },
  {
    "Tags": [
      "Reload"
    ],
    "Name": "Infinity Pocket",
    "Description": "Reloading an Empty Magazine refills 10% of the stowed weapon's Max Ammo. When stowed weapon is full, the refill amount applies to the primary weapon instead.",
    "Location": "A random world drop in N'Erud. (World drops are completely random and can appear anywhere in the world or its dungeons)"
  },
  {
    "Tags": [
      "Lifesteal"
    ],
    "Name": "Mortal Coil",
    "Description": "Increases All Damage dealt by 1% for every 2% of the wearer's total Lifesteal. Max 20% All Damage.",
    "Location": "Can be crafted at Spark, you will need the following Materials: x1 Fruit of Death and x25 Ancient Alloy"
  },
  {
    "Tags": [
      "Shield"
    ],
    "Name": "Nanofiber Strand",
    "Description": "Increases SHIELD Amount by 10%.",
    "Location": "A random world drop in N'Erud. (World drops are completely random and can appear anywhere in the world or its dungeons)"
  },
  {
    "Tags": [
      "OnPerfectDodge",
      "Lifesteal"
    ],
    "Name": "Nightmare Sigil",
    "Description": "On Perfect Dodge, increases base Lifesteal by 5% for 10s.",
    "Location": "A random world drop in Losomn. (World drops are completely random and can appear anywhere in the world or its dungeons);For the full list, see here."
  },
  {
    "Tags": [
      "ModPower"
    ],
    "Name": "Ring of Ashes",
    "Description": "Stowed weapons generate 15 Mod Power per second.",
    "Location": "Can be crafted at Spark, you will need the following Materials: x1 Crimson King Coin and x25 Mythril Alloy."
  },
  {
    "Tags": [
      "OnRelicUse",
      "AllDamage"
    ],
    "Name": "Ring Of Bones",
    "Description": "On Relic Use, increases All Damage by 10% for 15s.",
    "Location": "A random world drop in Yaesha. (World drops are completely random and can appear anywhere in the world or its dungeons)"
  },
  {
    "Tags": [
      "OnRelicUse",
      "Shield",
      "TeamBuff"
    ],
    "Name": "Security Half-Measure",
    "Description": "On Relic Use, sacrifices 15% of Max Health and grants a SHIELD for 10% of the wearer's Max Health to allies within 8m. Conversion cannot kill wearer. Lasts 15s.",
    "Location": "To optain:use the glider to the left of \"Waylaid Conservatory\"worldstone. glide around the buildings to the left. You should glide though a tight gap. After that there is a tornado to lauch you up to a small platform near \"mucid terrarium\"dungeon. Go inside the room and collect the ring."
  },
  {
    "Tags": [
      "Shield",
      "ModPower"
    ],
    "Name": "Shield Alternator",
    "Description": "Activating a Mod that costs 100 Mod Power or greater, generates a SHIELD for 20% of Max Health. Lasts 15s. Cannot stack with itself",
    "Location": "Dropped by The Prototype"
  },
  {
    "Tags": [
      "AllDamage",
      "Slow",
      "Haste"
    ],
    "Name": "Siphon Filter",
    "Description": "Increases All Damage dealt by an amount equal to an active HASTE bonus. Grants HASTE when within 15m of an entity suffering from SLOW.",
    "Location": "Can be found in the new dungeon \"logistics bridge\".;Too find this Ring, you need to go the following path after unlocking the 3rd and last mini checkpoint. You should be standing over other 2 trains. There should be a hidden decoration pod standing around, shoot it, to unlock a pathway with the ring laying there. Use \"fortune hunter\"from the explorer class too see the location of the ring."
  },
  {
    "Tags": [
      "Shield",
      "ModPower"
    ],
    "Name": "Spirit Alternator",
    "Description": "Incoming SHIELD grants 150% of the SHIELD generated as Mod Power",
    "Location": "The Spirit Alternator ring can be acquired by interacting with the Prototype Memory Core. Before handing the core to The Prototype, examine it and press the button located at the top. This will cause The Prototype to become friendly and reward you with the Spirit Alternator ring."
  },
  {
    "Tags": [
      "ModDamage",
      "ModPower",
      "Exposed"
    ],
    "Name": "Stone of Revelation",
    "Description": "Increases Mod Generation and Mod Damage by 5%. Bonus is doubled against EXPOSED targets",
    "Location": "A random world drop in Losomn. (World drops are completely random and can appear anywhere in the world or its dungeons)"
  },
  {
    "Tags": [
      "RangedChargedDamage"
    ],
    "Name": "Strand of Sinew",
    "Description": "Slows Firearm Charge Time by 30% and increases Ranged Charge Damage by 20%.",
    "Location": "Can be crafted at Spark, you will need the following Materials: x1 Nightweaver Stone Doll x25 Mythril Alloy"
  },
  {
    "Tags": [
      "OnPerfectDodge",
      "Bulwark"
    ],
    "Name": "Symbol of Royalty",
    "Description": "On Perfect Dodge, grants 1 stack of BULWARK for 10s. Max 3 stacks",
    "Location": "Purchase from Spark using 1x Kolket's Key (must interact with Kolket's Razor) and 25x Ancient Alloy"
  },
  {
    "Tags": [
      "FirearmChargeTime",
      "PerfectChargeWindow"
    ],
    "Name": "Tolerance Band",
    "Description": "Decreases Firearm Charge Time by 10% and increases Perfect Charge Window for applicable ranged weaponry",
    "Location": "A random world drop in N'Erud. (World drops are completely random and can appear anywhere in the world or its dungeons)"
  },
  {
    "Tags": [
      "AcidDamage",
      "AcidResistance"
    ],
    "Name": "Acid Stone",
    "Description": "Increases ACID damage by 15% and ACID Resistance by 20%.",
    "Location": "Can be bought from Reggie at Ward 13."
  },
  {
    "Tags": [
      "AllDamage",
      "StatusEffect"
    ],
    "Name": "Ahanae Crystal",
    "Description": "Deal 5% additional damage for each Status Effect the target is suffering from.",
    "Location": "Can be bought from Reggie after killing any Yaesha world boss in Hardcore mode on any difficulty."
  },
  {
    "Tags": [
      "OnPerfectDodge",
      "CriticalChance",
      "CriticalDamage"
    ],
    "Name": "Akari War Band",
    "Description": "Perfect Dodges increase Critical Chance by 10% and Critical Damage by 10% for 15s.",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "Lifesteal",
      "NegativeStatusEffect",
      "Blight"
    ],
    "Name": "Alchemy Stone",
    "Description": "Increases base Lifesteal by 6% while suffering from a negative STATUS or BLIGHT Effect.",
    "Location": "Can be found in Losomn as a random drop."
  },
  {
    "Tags": [
      "ElementalDamage"
    ],
    "Name": "Alumni Ring",
    "Description": "Increases all Elemental damage dealt by 10%.",
    "Location": "Can be found in Losomn - Morrow Parish. Found on a tomb outside of the Asylum after defeating The Nightweaver."
  },
  {
    "Tags": [
      "LowHealth",
      "DamageReduction",
      "NegativeStatusEffect"
    ],
    "Name": "Amber Moonstone",
    "Description": "When the wearer's Health drops below 35%, all incoming damage is reduced by 25% and wearer becomes immune to Temporary Status Effects.",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "OnHealingReceived",
      "Haste"
    ],
    "Name": "Anastasija's Inspiration",
    "Description": "When receiving healing effects, gain HASTE for 10s.",
    "Location": "Can be found in Root Earth - Also can be bought from Whispers at Ward 13"
  },
  {
    "Tags": [
      "FirearmChargeTime",
      "ProjectileSpeed"
    ],
    "Name": "Archer's Crest",
    "Description": "Increases Projectile Speed by 20% and Decreases Weapon Charge Time by 25%.",
    "Location": "Can be found in Yaesha - Endaira's End."
  },
  {
    "Tags": [
      "AllDamage",
      "EnemyAwareness"
    ],
    "Name": "Assassin's Seal",
    "Description": "Reduces enemy Awareness Range by 25%. Increases all damage dealt to enemies not targeting wearer by 10%.",
    "Location": "Can be found in Losomn - Council Tribunal."
  },
  {
    "Tags": [
      "ReviveSpeed",
      "RevivingSpeed",
      "DownedHealth",
      "DownedMovementSpeed"
    ],
    "Name": "Band Band",
    "Description": "Increases Speed of Revive and being Revived by 35%. Increases Downed Health and Downed Movement Speed by 100%.",
    "Location": "Can be found in Yaesha - Endaira's End. A reward for completing Wind Tower puzzle in co-op (requires two players to complete)."
  },
  {
    "Tags": [
      "OnAmmoPickup",
      "TeamBuff"
    ],
    "Name": "Band of Accord",
    "Description": "Ammo acquired on pickup is increased by 50% per ally also wearing this ring and is shared with other allies.",
    "Location": "Can be bought from Reggie after doing the High Five emote in co-op."
  },
  {
    "Tags": [
      "MeleeSpeed",
      "MeleeStaminaCost"
    ],
    "Name": "Berserker's Crest",
    "Description": "Increases Melee Speed by 10% and reduces Melee Stamina Cost by 30%.",
    "Location": "Can be found in Yaesha - The Chimney."
  },
  {
    "Tags": [
      "Stamina"
    ],
    "Name": "Bisected Ring",
    "Description": " Gain Infinite Stamina. All damage received is increased by 15%. ",
    "Location": "Found in the Labyrinth Backrooms, in The Labyrinth."
  },
  {
    "Tags": [
      "Fatal"
    ],
    "Name": "Black Cat Band",
    "Description": "When taking fatal damage, instead of dying, the wearer's Health will drop to 1, and Movement Speed will increase by 25% for 10s. 2m cooldown.",
    "Location": "Can be bought from Reggie after dying 15 times."
  },
  {
    "Tags": [
      "SkillCooldown"
    ],
    "Name": "Black Pawn Stamp",
    "Description": "Reduces Cooldowns of Skills by 10%.",
    "Location": "Can be found in Losomn. Player needs to complete The Flames Event using only the Blue Flames."
  },
  {
    "Tags": [
      "ReloadSpeed"
    ],
    "Name": "Blackout Ring",
    "Description": "Increases Reload Speed by 3% for every 20% of Magazine missing.",
    "Location": "Can be found in N'Erud - Vault of the Formless."
  },
  {
    "Tags": [
      "ExplosiveDamage"
    ],
    "Name": "Blasting Cap Ring",
    "Description": "Increases Explosive damage by 15%.",
    "Location": "Can be found in N'Erud - Timeless Horizon."
  },
  {
    "Tags": [
      "OnRelicUse",
      "Bulwark"
    ],
    "Name": "Blessed Ring",
    "Description": "After receiving a benefit from a Relic, gain 2 Stacks of BULWARK for 30s.",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "ChargedMeleeAttack",
      "Bleeding"
    ],
    "Name": "Blood Jewel",
    "Description": "Charged Melee Attacks apply BLEEDING, dealing 460 BLEED damage over 20s.",
    "Location": "Can be found in Yaesha - The Forbidden Grove."
  },
  {
    "Tags": [
      "HealthRegen",
      "Bleeding"
    ],
    "Name": "Blood Tinged Ring",
    "Description": "Gain 2 Health Regeneration per second when within 25m of a BLEEDING entity.",
    "Location": "Can be found in Yaesha - The Lament."
  },
  {
    "Tags": [
      "Resistance"
    ],
    "Name": "Booster Ring",
    "Description": "Increases all Status Resistances by 25.",
    "Location": "Can be found in Losomn - Council Chamber."
  },
  {
    "Tags": [
      "CriticalChance"
    ],
    "Name": "Braided Thorns",
    "Description": "Increases Critical Chance by 10%.",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "MeleeSpeed",
      "MeleeCriticalChance"
    ],
    "Name": "Brawler's Pride",
    "Description": "Increases Melee Attack Speed by 15% and Melee Critical Chance by 5%.",
    "Location": "Can be found in Yaesha as a random drop.;Exclusive Ring for The Awakened King DLC."
  },
  {
    "Tags": [
      "OnPerfectDodge",
      "Healing"
    ],
    "Name": "Burden of the Audacious",
    "Description": "Decreases all healing by 50%. Perfect Dodges heal for 25% of Max Health.",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "AllDamage"
    ],
    "Name": "Burden of the Destroyer",
    "Description": "Decreases Ideal Range of all Firearms by 35%. Increases all damage dealt by 15%.",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "Healing",
      "TeamBuff"
    ],
    "Name": "Burden of the Divine",
    "Description": "All damage dealt by wearer is reduced by 15%. 30% of self healing applies to allies.",
    "Location": "Can be found in Losomn as a random drop."
  },
  {
    "Tags": [
      "ModPower"
    ],
    "Name": "Burden of the Follower",
    "Description": "Reduces Fire Rate by 15%. Increases Mod Power Generation by 30%.",
    "Location": "Can be found in Yaesha - Endaira's End in a hidden room."
  },
  {
    "Tags": [
      "CriticalChance",
      "CriticalDamage"
    ],
    "Name": "Burden of the Gambler",
    "Description": "Disables Weakspots. Increases Critical Chance by 10% and Critical Damage by 15%.",
    "Location": "Cass in Ward 13 can potentially sell this ring."
  },
  {
    "Tags": [
      "ModPower"
    ],
    "Name": "Burden of the Mariner",
    "Description": "Increases Skill Cooldowns by 15%. Generate 15% additional Mod Power for each Skill on Cooldown.",
    "Location": "Can be found in N'Erud - Ascension Spire.;Can be crafted at Drzyr Replicator, you will need the following Materials: x10 Iron, 500 Scrap."
  },
  {
    "Tags": [
      "SkillCooldown"
    ],
    "Name": "Burden of the Rebel",
    "Description": " Reduces Relic Use Speed by 25%. Reduces Skill Cooldowns by 15%.",
    "Location": "Can be found in Yaesha - Red Throne, as a reward from the Eternal Empress if you give her the Thaen Seed."
  },
  {
    "Tags": [
      "SkillCooldown"
    ],
    "Name": "Burden of the Stargazer",
    "Description": "Reduces Skill Cooldowns by 15%. Activating a Skill costs 15% Health.",
    "Location": "Can be found in N'Erud - STARGAZER EVENT;ASTROPATH'S RESPITE;SPECTRUM NEXUS;TERMINUS STATION;TOWER OF THE UNSEEN"
  },
  {
    "Tags": [
      "ModPower",
      "GreyHealth"
    ],
    "Name": "Burden of the Warlock",
    "Description": "Reduces Mod Power Requirement by 15%. Activating a Mod costs 15% Health as Grey Health. Activation cannot kill wearer.",
    "Location": "Can be found in Losomn as a random drop."
  },
  {
    "Tags": [
      "ReviveSpeed",
      "RelicUseSpeed"
    ],
    "Name": "Captain's Insignia",
    "Description": "Increases Revive Speed and Relic Consume Speed by 25% per downed or dead ally. Max 2 stacks.",
    "Location": "Can be found in Yaesha - Endaira's End. Co-op only."
  },
  {
    "Tags": [
      "ModPower"
    ],
    "Name": "Cataloger's Jewel",
    "Description": "Automatically generates 10 Mod Power per second.",
    "Location": "Can be found in Losomn - Beatific Palace."
  },
  {
    "Tags": [
      "ConsumableUseSpeed",
      "RelicUseSpeed"
    ],
    "Name": "Celerity Stone",
    "Description": "Increases Consumable and Relic Use Speed by 25%.",
    "Location": "Can be found in Yaesha - The Lament."
  },
  {
    "Tags": [
      "OnKill",
      "FireRate",
      "MeleeAttackSpeed"
    ],
    "Name": "Compulsion Loop",
    "Description": "After killing an enemy, gain 5% Fire Rate and Melee Attack Speed for 10s. Stacks 3x.",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "LowHealth",
      "RelicUseChance",
      "RelicEfficacy"
    ],
    "Name": "Conservation Seal",
    "Description": "For every 10% of Health missing  (Max 50%) gain 10% chance to not consume Relic and 5% increased Relic Efficacy on next use.|",
    "Location": "Can be found in N'Erud - Vault of the Formless."
  },
  {
    "Tags": [
      "RangedDamage",
      "Overheat"
    ],
    "Name": "Constant Variable Ring",
    "Description": "Increases Ranged damage up to 20% based on current Weapon's Overheat value.",
    "Location": "Can be found in N'Erud - Tower of the Unseen."
  },
  {
    "Tags": [
      "Health"
    ],
    "Name": "Dead King's Memento",
    "Description": "Increases Health by 15.",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "Slide",
      "EvadeSpeed",
      "MovementSpeed"
    ],
    "Name": "Deceiver's Band",
    "Description": "After performing a Slide, gain 15% Evade Speed and 10% Movement Speed for 12s.",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "AmmoReserves"
    ],
    "Name": "Deep Pocket Ring",
    "Description": "Increases Ammo Reserves by 35%.",
    "Location": "Can be found in N'Erud as a random drop."
  },
  {
    "Tags": [
      "DamageReduction",
      "Reload"
    ],
    "Name": "Defensive Action Loop",
    "Description": "While reloading, and for 3s after reload completes, incoming damage is reduced by 10%.",
    "Location": "Can be found in N'Erud - Astropath's Respíte. Random Drop."
  },
  {
    "Tags": [
      "HealthRegen",
      "ModPower"
    ],
    "Name": "Dense Silicon Ring",
    "Description": "Gain 200% of Health Regenerated as Mod Power.",
    "Location": "Can be found in The Labyrinth."
  },
  {
    "Tags": [
      "OnCrit",
      "SkillCooldown"
    ],
    "Name": "Devoured Loop",
    "Description": "Critical Hits have 1% chance to reset Skill Cooldowns. Can only occur once every 10s. Increases all incoming damage by 10%.",
    "Location": "Can be bought from Reggie after completing Campaign on Apocalypse difficulty."
  },
  {
    "Tags": [
      "Encumbrance"
    ],
    "Name": "Dull Steel Ring",
    "Description": "Improves Dodge roll by 1 weight class.",
    "Location": "Can be bought from Reggie after defeating 15 World Bosses (can be done solo or co-op)."
  },
  {
    "Tags": [
      "StaminaRegen",
      "Melee"
    ],
    "Name": "Drakestone Pearl",
    "Description": "Enables Stamina Regeneration during Melee Attacks at 20% of the normal rate.",
    "Location": "Can be found in Losomn Sewer locations. Player needs to be grabbed by a Manticora."
  },
  {
    "Tags": [
      "Stamina",
      "Encumbrance"
    ],
    "Name": "Dran Memento",
    "Description": "Increases Max Stamina by 20 and reduces Encumbrance by 5.",
    "Location": "Can be found in Losomn, by saving the dran in The Burning Event;Burning can be prevented by killing all the enemies, not allowing any to light the fire under the hanging man."
  },
  {
    "Tags": [
      "OnScrapPickup",
      "OnAmmoPickup",
      "HealthRegen",
      "AllDamage"
    ],
    "Name": "Dran Scavenger Sigil",
    "Description": "Collecting Scrap, Iron, and Ammo pickups regenerates 50% of Max Health and increases all damage dealt by 8% for 30s.",
    "Location": "Can be bought from Reggie after defeating any Losomn world boss in Hardcore mode on any difficulty."
  },
  {
    "Tags": [
      "GreyHealthRegen"
    ],
    "Name": "Dread Font",
    "Description": "Increases Grey Health Regeneration rate by 2 per second.",
    "Location": "Can be found in Losomn as a random drop."
  },
  {
    "Tags": [
      "MaxFalloffRange"
    ],
    "Name": "Drzyr Sniper Sigil",
    "Description": "Increase the minimum damage at Max Fallof Range from 20% to 40%.",
    "Location": "Can be bought from Reggie after defeating any N'Erud world boss in Hardcore mode on any difficulty."
  },
  {
    "Tags": [
      "OnMeleeDamage",
      "Lifesteal"
    ],
    "Name": "Dying Ember",
    "Description": "Gain 6% of base Melee damage dealt as Lifesteal.",
    "Location": "Can be found in Root Earth - Ashen Wasteland."
  },
  {
    "Tags": [
      "DamageReduction",
      "NegativeStatusEffect",
      "Blight"
    ],
    "Name": "Embrace of Sha'Hala",
    "Description": "Wearer gains 7.5% incoming damage reduction for each Negative Status Effect or Blight they are suffering from. Max 2 stacks.",
    "Location": "Can be found in N'Erud, by speaking to The Custodian after defeating Sha'Hala."
  },
  {
    "Tags": [
      "HealthRegen",
      "OnModUse"
    ],
    "Name": "Encrypted Ring",
    "Description": "Using a Mod regenerates 20% of max HP over 10s. Reapplication increases duration up to a max of 30s.",
    "Location": "Can be found in The Labyrinth."
  },
  {
    "Tags": [
      "OnSprint",
      "HealthRegen"
    ],
    "Name": "Endaira's Endless Loop",
    "Description": "After Sprinting for 1s, the wearer gains 2 Health Regeneration per second until they stop Sprinting.",
    "Location": "Can be found in Yaesha - Endaira's End."
  },
  {
    "Tags": [
      "OnSkillUse",
      "Shield"
    ],
    "Name": "Excess Coil",
    "Description": "Activating a Skill grants a SHIELD for 25% of Max Health. Cannot stack with itself. Lasts 15s.",
    "Location": "Can be found in N'Erud - Robot Hanger event."
  },
  {
    "Tags": [
      "OnMeleeDamage",
      "Bulwark"
    ],
    "Name": "Fae Bruiser Ring",
    "Description": "Dealing Melee damage grants 2 Stack of BULWARK for 15s. Does not stack with itself.",
    "Location": "Can be found in Losomn as a random drop."
  },
  {
    "Tags": [
      "Range"
    ],
    "Name": "Fae Hunter Ring",
    "Description": "Increases Range of Firearms by 35%.",
    "Location": "Can be found in Losomn as a random drop."
  },
  {
    "Tags": [
      "Health",
      "Stamina",
      "Encumbrance"
    ],
    "Name": "Fae Protector Signet",
    "Description": "Increases Max Health and Stamina by 10 and Reduces Encumbrance by 5.",
    "Location": "Can be found in Losomn - Council Chamber. Players have to face The Council during The Fae Council Event."
  },
  {
    "Tags": [
      "HealthRegen",
      "RelicUseSpeed"
    ],
    "Name": "Fae Shaman Ring",
    "Description": "Increases Health Regeneration by 0.35 and Relic Use Speed by 25%.",
    "Location": "Can be found in Losomn - Council Chamber."
  },
  {
    "Tags": [
      "MeleeDamage"
    ],
    "Name": "Fae Warrior Ring",
    "Description": "Increases Melee Damage by 15%.",
    "Location": "Can be found in Losomn - Ironborough."
  },
  {
    "Tags": [
      "OnMeleeDamage",
      "ModPower"
    ],
    "Name": "Faelin's Sigil",
    "Description": "Melee Damage generates 15% additional Mod Power.",
    "Location": "Can be found in Losomn - Beatific Gallery. Given by Faelin if you kill Faerin and report to him."
  },
  {
    "Tags": [
      "OnWeakspotHit",
      "OnCrit",
      "ModPower"
    ],
    "Name": "Faerin's Sigil",
    "Description": "Critical and Weakspot Hits generates 12.5% additional Mod Power.",
    "Location": "Can be found in Losomn - Malefic Gallery. Given by Faerin if you kill Faelin and report to him."
  },
  {
    "Tags": [
      "ConcoctionLimit"
    ],
    "Name": "Feastmaster's Signet",
    "Description": "Increases active Concoction Limit by 1.",
    "Location": "Can be found in Losomn, The Great Hall. The ring is located behind the fireplace in the feast room."
  },
  {
    "Tags": [
      "AOE",
      "Shock",
      "Overloaded"
    ],
    "Name": "Feedback Loop",
    "Description": "Perfect Dodge triggers a 3m AOE blast that deal 115 SHOCK Damage and applies OVERLOADED, which deals SHOCK damage every 5s.",
    "Location": "Can be found in N'Erud -"
  },
  {
    "Tags": [
      "FireDamage",
      "FireResistance"
    ],
    "Name": "Fire Stone",
    "Description": "Increases FIRE damage by 15% and FIRE Resistance by 20.",
    "Location": "Can be found in Losomn - also can be bought from Reggie at Ward 13 for 500 "
  },
  {
    "Tags": [
      "MeleeDamage",
      "Encumbrance"
    ],
    "Name": "Flyweight's Sting",
    "Description": "Increases Melee damage while Armor Encumbrance is below 50. Damage bonus increases with lower Encumbrance, up to 25% at 0 Weight.",
    "Location": "Can be found in Root Earth - Corrupted Harbor."
  },
  {
    "Tags": [
      "Spread"
    ],
    "Name": "Focusing Shard",
    "Description": "Aiming Down Sights gradually reduces Spread up to 70% over 4s.",
    "Location": "Can be found in N'Erud -"
  },
  {
    "Tags": [
      "EvadeSpeed",
      "OnPerfectDodge",
      "FireRate",
      "MeleeSpeed"
    ],
    "Name": "Frivolous Band",
    "Description": "Increases Evade Speed by 10%. Perfect Evades increase Fire Rate by 10% and Melee Speed by 10% for 7s.",
    "Location": "Can be found in Yaesha  - The Forbidden Grove. Rewarded to the player by Bedel of the Vaunnt after reviving The Doe in the Ravager encounter. ;Player needs to choose sarcastic answers when first speaking to Bedel and choose \"Maybe...\" dialogue option when inquired about who saved The Doe. This reminds Bedel about his friend and he gives player the ring."
  },
  {
    "Tags": [
      "OnAmmoPickup"
    ],
    "Name": "Galvanized Resupply Band",
    "Description": "Increases Ammo Pickups by 100%.",
    "Location": "Can be found in N'Erud druring the Supply Ship Event."
  },
  {
    "Tags": [
      "TeamBuff",
      "Healing"
    ],
    "Name": "Game Master's Pride",
    "Description": "Reduces all healing by 50%. Splits all damage and remaining healing evenly amoung all allies wearing this ring.",
    "Location": "Can be found in Losomn - Postulant's Parlor. Co-op only."
  },
  {
    "Tags": [
      "HealthRegen",
      "Shield"
    ],
    "Name": "Generating Band",
    "Description": "Regenerate 3% of Max Health per second while a Shield is active.",
    "Location": "Can be found in N'Erud - The Flooded Room Event."
  },
  {
    "Tags": [
      "ShockDamage",
      "ShockResistance"
    ],
    "Name": "Grounding Stone",
    "Description": "Increases SHOCK damage by 15% and SHOCK Resistance by 20.",
    "Location": "Can be found in Losomn.;Can also can be bought from Reggie at Ward 13 for 500 "
  },
  {
    "Tags": [
      "OnEnemyProximity",
      "OnMeleeDamageReceived",
      "Bulwark"
    ],
    "Name": "Guardian's Ring",
    "Description": "Adds 1 Stack of BULWARK when within 15m of an enemy. Increases to 2 Stacks for 10s after taking Melee damage.",
    "Location": "Can be found in Yaesha - The Nameless Nest."
  },
  {
    "Tags": [
      "SwapSpeed",
      "ReloadSpeed"
    ],
    "Name": "Gunslinger's Ring",
    "Description": "Increases Firearm Swap Speed by 30% and Reload Speed by 10%.",
    "Location": "Ward 13: Talk to Mudtooth and ask him about his stories, repeat this multiple times (about 10 stories). Eventually Mudtooth will be thankful for your time and reward you with the Gunslinger's Ring."
  },
  {
    "Tags": [
      "OnDamageReceived",
      "Bulwark"
    ],
    "Name": "Hardcore Metal Band",
    "Description": "Taking damage adds 1 stack of BULWARK which individually falls of after 10s. Max 3 stacks.",
    "Location": "Can be found in N'Erud as a random drop."
  },
  {
    "Tags": [
      "DamageReduction",
      "LowHealth"
    ],
    "Name": "Hardened Coil",
    "Description": "Reduces all incoming damage by 3% for each 10% missing Health. Max 15% reduction.",
    "Location": "Can be found in Yaesha - Forgotten Field."
  },
  {
    "Tags": [
      "MeleeDamage",
      "Encumbrance"
    ],
    "Name": "Haymaker's Ring",
    "Description": "Increase Melee damage by 0.2% for every 1 points of Armor Encumbrance.",
    "Location": "Can be found in Root Earth - Ashen Wasteland."
  },
  {
    "Tags": [
      "Stamina",
      "MovementSpeed"
    ],
    "Name": "Heart of the Wolf",
    "Description": "Increases Max Stamina by 25 and Movement Speed by 10%.",
    "Location": "Can be found in Yaesha as a random drop."
  },
  {
    "Tags": [
      "CurseResistance"
    ],
    "Name": "Hex Ward",
    "Description": "Prevents CURSE Blight.",
    "Location": "Can be cafting at Nimue in Nimue's Retreat, you will need the following Materials: x5 Lumenite Crystal."
  },
  {
    "Tags": [
      "ModCastSpeed",
      "SkillCastSpeed"
    ],
    "Name": "Kinetic Cycle Stone",
    "Description": "Increases Mod and Skill Cast Speed by 20%.",
    "Location": "Can be found in Root Earth - Corrupted Harbor."
  },
  {
    "Tags": [
      "DamageReduction"
    ],
    "Name": "Lithic Signet",
    "Description": "Reduces all incoming damage by 7%.",
    "Location": "Can be found in Yaesha - The Lament - The Twisted Chantry."
  },
  {
    "Tags": [
      "AllDamage"
    ],
    "Name": "Lodestone Ring",
    "Description": "Increases all damage dealt against illuminated enemies by 5%.",
    "Location": "Rewarded by Bedel of the Vaunnt if the players talks to him while wearing the Lodestone Crown after defeating the Ravager."
  },
  {
    "Tags": [
      "OnKill",
      "HealthRegen"
    ],
    "Name": "Low Yield Recovery Ring",
    "Description": "Killing an enemy regenerates 6% Max Health over 6s. Additional kills increase duration by 6s. Max 30s.",
    "Location": "Can be found in N'Erud - Astropath's Respíte."
  },
  {
    "Tags": [
      "HeavyWeapon",
      "MovementSpeed",
      "Bulwark"
    ],
    "Name": "Mechanic's Cog",
    "Description": "While carrying an Engineer Heavy Weapon, gain 15% Movement Speed and 1 stack of BULWARK",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "OnKill",
      "ReloadSpeed"
    ],
    "Name": "Metal Driver",
    "Description": "Killing Blows increase Reload Speed by 10% for 15s. Stacks 3x.",
    "Location": "Can be found in N'Erud - Vault of the Formless."
  },
  {
    "Tags": [
      "Encumbrance",
      "UnarmedDamage"
    ],
    "Name": "Meteorite Shard Ring",
    "Description": "Increases Encumbrance by 50. Increases Unarmed damage by 50%.",
    "Location": "Can be found in N'Erud.;Can be crafted at Drzyr Replicator, you will need the following Materials: x10 Iron, 750 Scrap."
  },
  {
    "Tags": [
      "HeatGeneration",
      "HeatReductionRate"
    ],
    "Name": "Microcompressor",
    "Description": "Reduces Heat Generation when firing weapons that Overheat by 30%. Increases Heat Reduction Rate by 30%.",
    "Location": "Can be found in N'Erud.;Can be crafted at Drzyr Replicator, you will need the following Materials: x10 Forged Iron, 750 Scrap."
  },
  {
    "Tags": [
      "OnSprint",
      "MovementSpeed",
      "Stagger"
    ],
    "Name": "Momentum Driver",
    "Description": "After Sprinting for 1.5s, Movement Speed is increased by 15% and Stagger Level reduced by 1.",
    "Location": "Can be found in N'Erud -"
  },
  {
    "Tags": [
      "Reload",
      "ReloadSpeed"
    ],
    "Name": "Outcast Ring",
    "Description": "Increases Reload Speed by 5% for 10s after reloading. Stacks 5x.",
    "Location": "Can be found in Losomn, after completing the Man in the Sewers event. You have to give him the Spirit Wisp Amulet, and in turn you will receive the Outcast Ring"
  },
  {
    "Tags": [
      "Spread",
      "Recoil"
    ],
    "Name": "Point Focus Ring",
    "Description": "Reduces Initial Spread and Recoil by 30%.",
    "Location": "Can be found in N'Erud as a random drop."
  },
  {
    "Tags": [
      "OnDodge",
      "AllDamage"
    ],
    "Name": "Power Complex",
    "Description": "Increases All Damage dealt by 1% per second to a maximum of 15%. Dodging resets Power Complex to 0%",
    "Location": "Can be found in N'Erud as a random drop.;Exclusive Ring for The Awakened King DLC."
  },
  {
    "Tags": [
      "RelicUseChance",
      "MaxHealth"
    ],
    "Name": "Power Saver",
    "Description": "At Max Health, gain a 35% chance to not use a Relic charge.",
    "Location": "Can be found in N'Erud."
  },
  {
    "Tags": [
      "CriticalDamage"
    ],
    "Name": "Probability Cord",
    "Description": "Increases Crit Damage by 20%.",
    "Location": "Can be found in Root Earth - Corrupted Harbor."
  },
  {
    "Tags": [
      "OnKill",
      "MovementSpeed",
      "ConsumableUseSpeed"
    ],
    "Name": "Propulsion Loop",
    "Description": "After killing an enemy, increases Movement Speed by 5% and Consumable Use Speed by 10% for 10s. Stacks 3x.",
    "Location": "Can be found in N'Erud."
  },
  {
    "Tags": [
      "Reload"
    ],
    "Name": "Provisioner Ring",
    "Description": "Firearms reload over time while stowed.",
    "Location": "Can be bought from Reggie after deferating the Labyrinth Sentinel in Hardcore mode on any difficulty."
  },
  {
    "Tags": [
      "Lifesteal",
      "OnStatusRemoved"
    ],
    "Name": "Reaping Stone",
    "Description": "After an Elemental Status Effect is removed from wearer, they become immune to all Elemental Status Effects and gain 5% of base damage dealt as Lifesteal for 10s.",
    "Location": "Can be found in Root Earth - Ashen Wasteland."
  },
  {
    "Tags": [
      "Shield",
      "OnStaminaUse"
    ],
    "Name": "Rerouting Cable",
    "Description": "Gain 5% of Max Health as a SHIELD for 5s after spending 20 Stamina. Accumulation resets after 5s of inaction. Max 50% SHIELD.",
    "Location": "Can be found in N'Erud - Vault of the Formless."
  },
  {
    "Tags": [
      "HealthRegen",
      "LowHealth"
    ],
    "Name": "Reserve Boosting Gem",
    "Description": "Increases Health Regeneration by 0.5 per second. 1s after going below 50% Health, increases regeneration value to 2.5 per second until 50% Health is reached.",
    "Location": "Can be found in N'Erud - The Hatchery.;Can be found in N'Erud as a random drop, probably more in Putrid Domaine."
  },
  {
    "Tags": [
      "LowHealth",
      "DamageReduction"
    ],
    "Name": "Restriction Cord",
    "Description": "Restricts the wearer from Healing above 50% of their Max Health and reduces all incoming damage by 15%.",
    "Location": "Can be bought from Bedel of The Vaunnt in Yaesha."
  },
  {
    "Tags": [
      "LowHealth",
      "Shield"
    ],
    "Name": "Ring of Crisis",
    "Description": "When wearer's Health drops below 25%, gain a Shield for 25% of Max Health. Lasts 10s.",
    "Location": "Can be found in N'Erud - The Hatchery."
  },
  {
    "Tags": [
      "GreyHealth"
    ],
    "Name": "Ring Of Deflection",
    "Description": "Direct Damage against wearer has a 50% Chance to be converted entirely to Grey Health.",
    "Location": "Can be found in N'Erud -"
  },
  {
    "Tags": [
      "EvadeWindow"
    ],
    "Name": "Ring of Diversion",
    "Description": "Increases invulnerability window while evading and sliding.",
    "Location": "Can be found in Yaesha - The Lament, inside the tomb past the floating pillar trap. The door to the tomb is opened with Kolket's Key."
  },
  {
    "Tags": [
      "RangedWeakspotDamage",
      "RangedDamage"
    ],
    "Name": "Ring of Flawed Beauty",
    "Description": "Ranged Weakspot damage is increased by 25%. Ranged damage is reduced by 15% when failing to hit a Weakspot.",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "OnDamageReceived",
      "HealthRegen"
    ],
    "Name": "Ring of Grace",
    "Description": "Taking enemy damage causes 15% of Maximum Health to regenerate over 10s.",
    "Location": "Can be found in Losomn - Harvester's Reach, by completing Riewen's request."
  },
  {
    "Tags": [
      "GreyHealth",
      "Stamina"
    ],
    "Name": "Ring of Omens",
    "Description": "Evades cost 15% Max Health as Grey Health instead of Stamina.",
    "Location": "Can be found in Yaesha - Cathedral of Omens. After solving the Blood Moon puzzle (opening the right side door) can be found behind a red trap door on the ground. Trap door only opens if a Blood Moon is present."
  },
  {
    "Tags": [
      "OnCritKill",
      "OnWeakspotKill",
      "ReloadSpeed"
    ],
    "Name": "Ring Of Restocking",
    "Description": "Reloads within 5s of a Critical Hit or Weakspot Kill are 20% faster.",
    "Location": "Can be found in N'Erud, Random Drop."
  },
  {
    "Tags": [
      "OnDamageReceived",
      "ReloadSpeed",
      "AllDamage"
    ],
    "Name": "Ring Of Retribution",
    "Description": "Incoming enemy damage increases Reload Speed and all outgoing damage by 15%. Lasts 15s.",
    "Location": "Feed Dria's Anklet at the Nightweaver's Web."
  },
  {
    "Tags": [
      "CriticalChance",
      "GreyHealth",
      "AllDamage"
    ],
    "Name": "Ring of the Damned",
    "Description": "Increases All Damage by 0.4% for every 1% of Grey Health. Increases Critical Chance by 5% if  at least 50% of Max Health is Grey.",
    "Location": "Can be found in Losomn, The Great Sewers."
  },
  {
    "Tags": [
      "RelicHealingEfficacy"
    ],
    "Name": "Ring of the Forest Spirit",
    "Description": "Relic Healing Effectiveness is increased by 15%.",
    "Location": "Can be found in Yaesha - The Forbidden Grove or The Forgotten Field as a random drop."
  },
  {
    "Tags": [
      "Health",
      "Armor"
    ],
    "Name": "Ring of the Robust",
    "Description": "Increases Max Health by 10, and Armor by 20.",
    "Location": "Can be found in Losomn as a random drop."
  },
  {
    "Tags": [
      "LowHealth",
      "MovementSpeed",
      "ReloadSpeed"
    ],
    "Name": "Rock of Anguish",
    "Description": "Gain 5% Movement Speed and 7.5% Reload Speed for every 25% of Max Healthmissing.",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "RootRotResistance"
    ],
    "Name": "Rotward",
    "Description": "Prevents ROOT ROT Blight.",
    "Location": "Can be bought from Bedel of The Vaunnt in Yaesha."
  },
  {
    "Tags": [
      "Bulwark",
      "LowHealth"
    ],
    "Name": "Rusted Heirloom",
    "Description": "Grants 2 Stacks of BULWARK below 50% Max HP.",
    "Location": "Can be found in Losomn sewer locations, in a hidden room in a locked safe."
  },
  {
    "Tags": [
      "Experience"
    ],
    "Name": "Sagestone",
    "Description": "Increases earned Experience by 10%.",
    "Location": "Yaesha - Possible spawn in The Lament;Yaesha - Possible spawn in The Twisted Chantry"
  },
  {
    "Tags": [
      "OnCrit",
      "SkillCooldown"
    ],
    "Name": "Sapphire Dreamstone",
    "Description": "Critical Hits reduce Skill Cooldowns by 4%. Can only happen once every 2s.",
    "Location": "Can be found in Losomn - Council Chamber. Players have to take a secret path in order to find it."
  },
  {
    "Tags": [
      "Health",
      "Stamina"
    ],
    "Name": "Seal of the Empress",
    "Description": "Increases Max Health by 20. Reduces Max Stamina by 5.",
    "Location": "Can be found in Yaesha - The Red Throne. Rewarded by The Eternal Empress if the player finishes the main quest without giving her the Thaen Seed."
  },
  {
    "Tags": [
      "ModDamage"
    ],
    "Name": "Shard Banded Ring",
    "Description": "Increases Mod damage by 12%.",
    "Location": "Can be found in The Labyrinth."
  },
  {
    "Tags": [
      "Reload",
      "ModPower"
    ],
    "Name": "Shiny Hog Lure",
    "Description": "Reloading grants 25-50 Mod Power to both weapons based on percentage of Magazine reloaded.",
    "Location": "Can be found in Losomn - Butcher's Quarter."
  },
  {
    "Tags": [
      "AllDamage",
      "Burning"
    ],
    "Name": "Singed Ring",
    "Description": "Increases all damage dealt to BURNING enemies by 12%.",
    "Location": "Can be found in Losomn - Butcher's Quarter. watch or fail to save the hanging man during the burning event. use the checkpoint and then kill the pig next to the man"
  },
  {
    "Tags": [
      "MeleeDamage"
    ],
    "Name": "Slayer's Crest",
    "Description": "Increases Melee damage by 25% when attacking enemies from behind",
    "Location": "Can be found in Yaesha - The Nameless Nest."
  },
  {
    "Tags": [
      "Bulwark",
      "Summons"
    ],
    "Name": "Soul Guard",
    "Description": "Gain a stack of BULWARK for each active Summon.",
    "Location": "Can be found in Yaesha ;Can be crafted at Bloodmoon Altar. Required Material: Blood Moon Essence"
  },
  {
    "Tags": [
      "Summons",
      "Lifesteal"
    ],
    "Name": "Soul Link",
    "Description": "Summons Lifesteal 5% of base damage dealt which returns to the wearer as Health.",
    "Location": "Can be found in Yaesha - The Withering Weald - The Nameless Nest."
  },
  {
    "Tags": [
      "ModPower"
    ],
    "Name": "Spirit Stone",
    "Description": "Increases Mod Power generation by 10%.",
    "Location": "Can be found in Yaesha - The Twisted Chantry."
  },
  {
    "Tags": [
      "OnAmmoPickup",
      "WeaponDamage"
    ],
    "Name": "Stockpile Charger",
    "Description": "After picking up ammo, increases the damage of that Ammo Type by 15% for 20s.",
    "Location": "Can be found in  Losomn as a random drop."
  },
  {
    "Tags": [
      "AllDamage"
    ],
    "Name": "Stone of Balance",
    "Description": "Increases all damage by 7%.",
    "Location": "Can be found on Yaesha. Random drop."
  },
  {
    "Tags": [
      "SkillDuration"
    ],
    "Name": "Stone of Continuance",
    "Description": "Increases Skill Duration by 15%.",
    "Location": "Can be found in N'Erud - Tower of the Unseen. Random Drop."
  },
  {
    "Tags": [
      "RangedDamage"
    ],
    "Name": "Stone of Expanse",
    "Description": "Increases Ranged damage by 12%. Reduces all other damage dealt by 5%.",
    "Location": "Can be found in N'Erud."
  },
  {
    "Tags": [
      "ElementalDamage",
      "ModPower"
    ],
    "Name": "Stone Of Malevolence",
    "Description": "Elemental damage generates 15% as additional Mod Power.",
    "Location": "Can be found in Losomn - random world drop."
  },
  {
    "Tags": [
      "OnSkillUse",
      "HealthRegen"
    ],
    "Name": "Stream Coupler",
    "Description": "Using a Skill regenerates 25% of Max Health over 10s.",
    "Location": "Can be found in Losomn - Cotton's Kiln, random world drop."
  },
  {
    "Tags": [
      "OnKill",
      "ModCastSpeed",
      "SkillCastSpeed"
    ],
    "Name": "Subterfuge Link",
    "Description": "After killing an enemy, increases the Cast Speed of the next Mod or Skill Cast by 35%. Lasts 15s or until consumed.",
    "Location": "Can be found in N'Erud."
  },
  {
    "Tags": [
      "SuppressionResistance"
    ],
    "Name": "Suppression Ward",
    "Description": "Prevents SUPPRESSION Blight.",
    "Location": "Can be found in N'Erud.;Can be crafted at Drzyr Replicator, you will need the following Materials: x5 Iron, 250 Scrap."
  },
  {
    "Tags": [
      "Spread",
      "Range"
    ],
    "Name": "Targeting Jewel",
    "Description": "Increases Range on all Firearms by 4m. Reduces Spread by 15%.",
    "Location": "Can be found in N'Erud."
  },
  {
    "Tags": [
      "UnarmedDamage"
    ],
    "Name": "Tarnished Ring",
    "Description": "Increases damage of Unarmed Attacks by 30%.",
    "Location": "It can be found in Ward 13.;Near the armor merchant, there is a ladder, climb that ladder and talk to the man on the bed. He'll mention a story, keep interacting with him until he gives you the ring."
  },
  {
    "Tags": [
      "RelicCapacity"
    ],
    "Name": "Tear of Kaeula",
    "Description": "Increases Relic capacity by 2 while equipped",
    "Location": "Can be found in Yaesha - Kaeula's Rest."
  },
  {
    "Tags": [
      "AllDamage",
      "Resistance",
      "OnElementalDamageReceived"
    ],
    "Name": "Tempest Conduit",
    "Description": "After receiving Elemental Damage, increases all damage dealt by 15% and Resistance to the received Element by 20 for 15s.",
    "Location": "Can be found in Yaesha - Endaira's End."
  },
  {
    "Tags": [
      "Shield"
    ],
    "Name": "Tightly Wound Coil",
    "Description": "When spending 75% or more of current magazine, gain a SHIELD for 15% of Max Health for 5s. Does not stack with itself.",
    "Location": "Can be found in N'Erud - Void Vessel Facility."
  },
  {
    "Tags": [
      "StatusEffectDuration"
    ],
    "Name": "Timekeeper's Jewel",
    "Description": "Increases the duration of all Status Effects applied by wearer. Durations varies per status.",
    "Location": "Can be found in Losomn at the top of the Hewdas Clock. Open the chest near one of the windows to find it."
  },
  {
    "Tags": [
      "MovementSpeed"
    ],
    "Name": "Tomb Dweller's Ring",
    "Description": "Increases Movement Speed by 10% for 15s after Vaulting, Climbing, Leaping, and entering Water, stacks 3x. Reduces Fall Damage by 50%.",
    "Location": "Can be found in Yaesha - The Lament after going through a hidden passageway."
  },
  {
    "Tags": [
      "Shield",
      "OnScrapPickup",
      "OnAmmoPickup"
    ],
    "Name": "Vacuum Seal",
    "Description": "Increases Automatic Pickup Range for Scrap by 150%. Picking up Scrap, Iron, or Ammo grants a SHIELD for 15% of Max Health for l0s Does not stack.",
    "Location": "Can be found in N'Erud - Tower of the Unseen. Random Drop."
  },
  {
    "Tags": [
      "RangedDamage",
      "MeleeDamage"
    ],
    "Name": "Vestige of Power",
    "Description": "After 5s of not being damaged, increases Ranged and Melee Damage by 10%.",
    "Location": "Can be found in Yaesha - The Chimney - Faithless Thicket"
  },
  {
    "Tags": [
      "OnKill",
      "RangedDamage",
      "MeleeDamage"
    ],
    "Name": "Wax Sealed Ring",
    "Description": "Killing blows increase Ranged and Melee Damage by 4% for 15s. Stacks 3x.",
    "Location": "Can be found in Yaesha - The Far Woods."
  },
  {
    "Tags": [
      "ModPower"
    ],
    "Name": "White Pawn Stamp",
    "Description": "Reduces Mod Power Requirement by 10%.",
    "Location": "Can be found in Losomn. Player needs to complete The Flames Event using only the White Flames."
  },
  {
    "Tags": [
      "ReloadSpeed"
    ],
    "Name": "Wind Hollow Circlet",
    "Description": "Increases Reload Speed by 12%.",
    "Location": "Can be found in Yaesha - Endaira's End."
  },
  {
    "Tags": [
      "AllDamage"
    ],
    "Name": "Worn Admiral's Ring",
    "Description": "All damage received is increased by 200%. All damage dealt is increased by 15%.",
    "Location": "Can be bought from Reggie at Ward 13 for 500 "
  },
  {
    "Tags": [
      "WeakspotDamage"
    ],
    "Name": "Zania's Malice",
    "Description": "Dealing Weakspot damage increases Weakspot damage by 5% for 5s. Stacks 4x.",
    "Location": "Can be found in Root Earth - Ashen Wasteland."
  },
  {
    "Tags": [
      "ModDuration"
    ],
    "Name": "Zohee's Ring",
    "Description": "Increases Mod Duration by 20%.",
    "Location": "Can be found in Yaesha - Red Throne. Given to the player by Queen's Assistant after defeating the Corruptor, if Arrest  event was triggered."
  },
  {
    "Tags": [
      "HeavyWeaponDamage",
      "HeavyWeaponCritChance"
    ],
    "Name": "A'taerii Booster",
    "Description": "Heavy Weapons gain 10% Damage and 10% Critical Chance in both Carry Mode and Turret Mode",
    "Location": " Can be found in N'erud."
  },
  {
    "Tags": [
      "CriticalChance",
      "Bleeding"
    ],
    "Name": "Atonement Fold",
    "Description": "Self-inflicts BLEEDING Status upon the wearer, causing 1.1 BLEED damage per second. Increases Critical Chance by 5%",
    "Location": "Can be bought from Leywise in Forlorn Coast for x500 Scrap;Exclusive Ring for The Awakened King DLC."
  },
  {
    "Tags": [
      "StatusEffectDamage",
      "StatusEffectDuration"
    ],
    "Name": "Band of the Fanatic",
    "Description": "Increases Status Effect Damage by 30% and reduces Status Effect Duration by 50%",
    "Location": "Given the Preacher if you are wearing the whole Zealot's Set.;Exclusive Ring for The Awakened King DLC."
  },
  {
    "Tags": [
      "GreyHealth"
    ],
    "Name": "Bitter Memento",
    "Description": "Sets 1% of wearer's Max Health as Grey Health. Using a skill converts 33.5% Max Health into Grey Health. Conversion cannot kill the wearer.",
    "Location": "Losomn - Offer Memoriam Medallion Key to Nightweaver's Web."
  },
  {
    "Tags": [
      "OnPerfectDodge",
      "MeleeDamage",
      "DamageReduction"
    ],
    "Name": "Bridge Wardens Crest",
    "Description": "Perfect Dodge increases Melee Damage by 20% for 10 seconds. Perfect Evade Flop also gains 10% Damage Reduction for the duration.",
    "Location": "When you speak to the Bridge Warden and have NOT killed any of the Fae who are fighting with the Dran, he will award you this ring and praise you for not succumbing to the blood hunger."
  },
  {
    "Tags": [
      "RelicCapacity",
      "AllDamage"
    ],
    "Name": "Burden of the Departed",
    "Description": "Reduces Total Relic Charges by 33%. Increases all damage dealt by 10%.",
    "Location": "Defeat The One True King while having Burden of the Divine equipped."
  },
  {
    "Tags": [
      "AmmoReserves",
      "ModDamage",
      "SkillDamage"
    ],
    "Name": "Burden of the Sciolist",
    "Description": "Reduces Ammo Reserves by 20%. Increases Mod and Skill Damage by 15%",
    "Location": "Give the Bookbound Medallion to Leywise to receive the Burden of the Sciolist;Exclusive Ring for The Awakened King DLC."
  },
  {
    "Tags": [
      "OnCrit",
      "SkillDamage"
    ],
    "Name": "Crimson Dreamstone",
    "Description": "Crit hits increase Skill Damage 2% for 5s. Max stack 10.",
    "Location": "Use Liquid Escape while taking on the Ethereal Manor Event"
  },
  {
    "Tags": [
      "OnReload",
      "ModDamage"
    ],
    "Name": "Digested Hog Lure",
    "Description": " Reloading increases Mod Damage by 15% for 7s. ",
    "Location": "Can be found in Forlorn Coast. Dropped by one of the hogs that attack you near the anchor statue.;Exclusive Ring for The Awakened King DLC."
  },
  {
    "Tags": [
      "Bulwark",
      "AllDamage"
    ],
    "Name": "Dried Clay Ring",
    "Description": "Grants 1 stack of BULWARK. Increases All Damage by 50% of the total Damage Reduction granted by BULWARK stacks",
    "Location": "Random drop in Losomn."
  },
  {
    "Tags": [
      "Encumbrance"
    ],
    "Name": "Elevated Ring",
    "Description": "Increases Dodge Weight Threshold by 10. Reduces Encumbrance by 10",
    "Location": "Can be found in Forlorn Coast. As you access the lift to get down, on a body in front of you.;Exclusive Ring for The Awakened King DLC."
  },
  {
    "Tags": [
      "OnRelicUse",
      "ModDamage"
    ],
    "Name": "Jewel of the Beholden",
    "Description": "On Relic Use, increase Mod Damage by 15% for 15s",
    "Location": "Can be found in Forlorn Coast. Given by Nimue if players kill The One True King, but don't talk to her previously.;Exclusive Ring for The Awakened King DLC."
  },
  {
    "Tags": [
      "ModPower",
      "NegativeStatusEffect"
    ],
    "Name": "Lighthouse Keeper's Ring",
    "Description": "Automatically generate 4 Mod Power per second for each entity within 15m suffering from a Negative Status Effect. Max 5 stacks.",
    "Location": "Unlock the door of the Lighthouse in Derelict Lighthouse using the Lighthouse Key and in the next room you will find the Ring.;Exclusive Ring for The Awakened King DLC."
  },
  {
    "Tags": [
      "OnRangedDamageDealt",
      "AllDamage",
      "OnKill"
    ],
    "Name": "Offering Stone",
    "Description": "Dealing Ranged Damage increases all Damage by 1% for 1s. Stacks 15x. After killing an enemy, extends the duration to 10s.",
    "Location": "Can be found in Losomn as a random drop."
  },
  {
    "Tags": [
      "GreyHealth",
      "Haste",
      "Bulwark"
    ],
    "Name": "Painless Obsidian",
    "Description": "When Grey Health is present, gain HASTE and 1 stack of BULWARK.",
    "Location": "Losomn Random World Drop"
  },
  {
    "Tags": [
      "NegativeStatusEffect"
    ],
    "Name": "Red Ring of Death",
    "Description": "Duplicates the last damaging Negative Status applied to target. Reduces outgoing Status Effect Damage by 10%.",
    "Location": "Found randomly in Losomn"
  },
  {
    "Tags": [
      "FireRate"
    ],
    "Name": "Ring of Infinite Damage",
    "Description": "Increases fire rate by 8%.",
    "Location": "Refuse to give the Bookbound Medallion to Leywise the first time, and accept the second time.;Exclusive Ring for The Awakened King DLC."
  },
  {
    "Tags": [
      "ConsumableDuration"
    ],
    "Name": "Ring of the Castaway",
    "Description": "Increases base Consumable Duration by 50%",
    "Location": "Can be found in The Forgotten Comune. In the scaffolding area, climb up and jump to the side to find it on a body"
  },
  {
    "Tags": [
      "EvadeWindow",
      "ADSMovementSpeed"
    ],
    "Name": "Ring of the Vain",
    "Description": "Reduces Invulnerability Window on Evade and Combat Slide by 35%. Increases Movement Speed while aiming by 35%",
    "Location": "Random world drop in Losomn"
  },
  {
    "Tags": [
      "StatusEffectDamage"
    ],
    "Name": "Shadow of Misery",
    "Description": " Increase Status Effect Damage by 20% ",
    "Location": "Random world drop in Losomn"
  },
  {
    "Tags": [
      "SkillDamage"
    ],
    "Name": "Shaed Stone",
    "Description": "Increases Skill damage by 15%",
    "Location": "Can be found at Glistering Cloister Dungeon: Can be found by solving the mirror puzzle."
  },
  {
    "Tags": [
      "Summons",
      "AllDamage"
    ],
    "Name": "Soul Shard",
    "Description": "Increase all damage dealt by 5% for each summon. Max 15%",
    "Location": "Can be found in Yaesha as a random drop."
  },
  {
    "Tags": [
      "StaggerDamage"
    ],
    "Name": "Wood Ring",
    "Description": " Increases Stagger Damage by 15% ",
    "Location": "Can be found in Losomn as a random drop."
  },
  {
    "Tags": [
      "OnPerfectDodge",
      "Shield"
    ],
    "Name": "White Glass Bead",
    "Description": "Perfect Dodge applies a SHIELD for 15% of Max Health. Lasts 10s. Cannot Stack with itself.",
    "Location": "Acquired by insisting Leywise eat the Feast Master's Leftovers given to you by the Feastmaster in The Great Hall assuming you've met Leywise prior to the conversation on the same world roll of The Awakened King DLC. This also unlocks an Achievement called A Foul Feast."
  },
  {
    "Tags": [
      "AllDamage"
    ],
    "Name": "Burden of the Mesmer",
    "Description": "Reduces Max Health by 20%. Increases All Damage by 1% for every 5% of the wearer's total Damage Reduction.",
    "Location": "Sold by Walt for 100,000 Scrap;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "OnPerfectDodge",
      "ChargedMeleeStaminaCost"
    ],
    "Name": "Matriarch's Ring",
    "Description": "Perfect Dodge reduces Charge Melee Stamina Cost by 100% for 7s.",
    "Location": "The Ancient Canopy, Yaesha.;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "Bleeding",
      "AllDamage",
      "CriticalChance"
    ],
    "Name": "Ravager's Bargain",
    "Description": "Increases All Damage by 5% and Critical Chance by 5% while BLEEDING",
    "Location": "Sold by Walt for 500 Scrap;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "Exposed",
      "AllDamage",
      "CriticalChance"
    ],
    "Name": "Token of Favor",
    "Description": "Increases All damage by 5%. Gain 10% Critical Chance against EXPOSED targets.",
    "Location": "Can be found in the Deserted Atelier, at the side of the giant deer statue.;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "Healing",
      "Lifesteal"
    ],
    "Name": "Tear of Lydusa",
    "Description": "Increases Healing and Lifesteal Efficacy by 20%. Reduces Healing Efficacy bonus by 1.5% for each 10% of missing Relic Capacity.",
    "Location": "The Bloodless Throne, Yaesha. Exclusive to The Forgotten Kingdom.;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "GreyHealth",
      "OnMeleeDamage"
    ],
    "Name": "Rally Band",
    "Description": "Melee Strikes convert Grey Health into Health.Each melee strike converts up to 10% of Max Health.",
    "Location": "It can be acquired as a gift from Private Jack Driver after talking to him and agreeing to take him back home. Yaesha, Luminous Vale.;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "Bulwark",
      "StaminaRegen"
    ],
    "Name": "Thalos Eyelet",
    "Description": " Grants 1 stack of BULWARK and 2 Stamina Regen per second for each BULWARK stack. Increases BULWARK maximum stacks to 6. ",
    "Location": "Luminous Vale, Yaesha. On a skeleton;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "AOE",
      "OnPerfectDodge",
      "Explosive"
    ],
    "Name": "Mark of the Destroyer",
    "Description": "Perfect Dodge triggers a 3m AOE blast that deals 310 Explosive Damage.",
    "Location": "Completing the Moon Puzzle in Yaesha;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "ProjectileSpeed",
      "WeaponChargeTime",
      "Haste"
    ],
    "Name": "Feathery Binding",
    "Description": "Increases projectile speed by 15% and decreases Weapon Charge Time by 10%. Bonus is doubled when HASTE is active.",
    "Location": "Given by Walt after defeating Lydusa.;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "DamageReduction",
      "Encumbrance"
    ],
    "Name": "Gul Signet",
    "Description": "Increases Damage Reduction by 10%. Each Weight Class above LIGHT reduces Damage Reduction bonus by 2.5% (up to 3x).",
    "Location": "Random world drop, Deserted Atelier Area;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "ModPower"
    ],
    "Name": "Ring of Spirits",
    "Description": "Increases Mod Generation by 3% for each active consumable. Max 5 stacks.",
    "Location": "Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "Lifesteal"
    ],
    "Name": "Bloodless King's Vow",
    "Description": "Gain 4% of base Ranged Damage dealt as Lifesteal.",
    "Location": "Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "Encumbrance",
      "MeleeDamage"
    ],
    "Name": "Burden of the Mason",
    "Description": "Impairs Dodges by 1 Weight Class. Increases Melee damage by 35% of the wearer total Damage Reduction.",
    "Location": "In Luminous Vale, you have two elevators, the first accessible one has a secret passage and one can notice it while riding the elevator.;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "NegativeStatusEffect",
      "HealthRegen"
    ],
    "Name": "Black Spinel",
    "Description": "Applying a Negative Status Effect grants 2% Max Health per second for 3s. Applying or refreshing a Negative Status Effect while buff is active will increase the duration by 1.5s. Max 15s.",
    "Location": "Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "OnRelicUse",
      "ElementalDamage"
    ],
    "Name": "Dark Sea Armada Crest",
    "Description": "On Relic Use, increases All elemental Damage dealt by 15% for 15s.",
    "Location": "Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "Summons",
      "Aura",
      "Stagger",
      "GreyHealth"
    ],
    "Name": "Conjurer's Circle",
    "Description": "When wearer's Summon enters the battlefield, conjure a 5m Summoning Circle. Allies in the Summoning Circle have their Stagger Level reduced by 1 and generate 5 Grey Health per second. Lasts 10s.Can only happen once every 10s after expiring.",
    "Location": "Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "Shield",
      "OnChargedShot"
    ],
    "Name": "Closed Loop",
    "Description": "Gain 5% of Max Health as a SHIELD for 10s after a Charged Shot. Accumulation resets after 10s of inaction. Max 25% SHIELD.",
    "Location": "Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "Exposed",
      "WeakspotDamage"
    ],
    "Name": "Floodlit Diamond",
    "Description": "Increases Weakspot Damage by 12% bonus is doubled against EXPOSED targets.",
    "Location": "in the Proving Grounds dungeon.;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "Bulwark",
      "HealthRegen"
    ],
    "Name": "Kolket Eyelet",
    "Description": "Grants 1 stack of Bulwark. Increases Health Regeneration by 0.3 per second for each stack of Bulwark.",
    "Location": "Random drop;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "ModPower"
    ],
    "Name": "Leaking Gemstone",
    "Description": "Allows 20% of Mod power Generation to continue during an active mod. ",
    "Location": "Losomn random drop;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "Melee"
    ],
    "Name": "Sealed Resin Loop",
    "Description": "Melee attacks can be cancelled mid action by Dodging.",
    "Location": "Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "HeavyWeapon"
    ],
    "Name": "Ring of Ordnance",
    "Description": "Allows Heavy Weapon Ammo to gradually regenerate while in both Heavy Carry or turret modes. Doubles the stowed Ammo Regeneration Rate of Heavy Weapons.",
    "Location": "Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "MovementSpeed",
      "ReloadSpeed",
      "FireRate",
      "Cooperation"
    ],
    "Name": "Pan War Band",
    "Description": "Increases Movement Speed and Reload Speed by 3%  and Fire Rate by 2% for each ally wearing this ring.",
    "Location": "Infested Abyss has a coop puzzle. One player on Pressure Plate, other Player gets on the pillar that was lowered. Player on Pressure plate then steps off of plate. Reward is Pan War Band.;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "Summons",
      "SkillCooldown"
    ],
    "Name": "Soul Feast",
    "Description": "When human, companion or minion is downed or killed, reduce skill Cooldowns by 8%.",
    "Location": "Random Yaesha drop;Exclusive to The Forgotten Kingdom DLC."
  }
]