[
  {
    "Tags": [
      "CriticalChance",
      "MovementSpeed",
      "OnDodge"
    ],
    "Name": "Brazen Amalgam",
    "Description": "Increases Critical Chance by 1.5% and Movement Speed while Aiming by 2.5% per second. Max 10 stacks. Dodge, Slide, or Flop removes stacks.",
    "Location": "N'erud - Logistic Bridge: hidden in a passage under the fourth train you cross.;Exclusive to The Dark Horizon DLC."
  },
  {
    "Tags": [
      "AllDamage",
      "CriticalChance",
      "CriticalDamage",
      "GreyHealth"
    ],
    "Name": "Canine Keepsake",
    "Description": "Increases All Damage by 2.5%, Critical Chance by 1.5%, and Critical Damage by 1.5% for every 5% of total Health present as Grey Health. Max 10 stacks.",
    "Location": "Can be found in Yaesha as a random world drop."
  },
  {
    "Tags": [
      "Shield",
      "AllDamage",
      "OnModUse"
    ],
    "Name": "Cessation Bulbel",
    "Description": "Activating a Mod consumes all current SHIELD. For every 20 SHIELD consumed, increases All Damage dealt by 4% for 10s. Max 10 stacks.",
    "Location": "To complete this, you need to go to the root plant in the Ward 13 area added in DLC 2 and offer the Crop Sample along with Nimue's Blood-Marred Vow. After that, you must equip certain items before talking to it. Make sure you are playing as Invader or Summoner, wearing their full armor sets and having the Profane Soul Stone equipped. When you talk to it, it will thank you for dooming the Earth, and as a reward, you'll get to ask it one lore question and also receive the amulet."
  },
  {
    "Tags": [
      "OnPerfectDodge",
      "OnRelicUse"
    ],
    "Name": "Chef Medal",
    "Description": "On Perfect Dodge, automatically trigger effects that require Relic Use to activate.",
    "Location": "Talk to Duane at Ward 13 after obtaining all Concotions from him (Meat Shake, Egg Drink and Numbing Agent)."
  },
  {
    "Tags": [
      "DamageReduction",
      "OnDamageReceived",
      "OnPerfectDodge"
    ],
    "Name": "Crisis Core",
    "Description": "When a single source of Enemy Damage exceeds 15% of Max Health, automatically trigger effects that require Perfect Dodge to activate and gain 15% Damage Reduction for 3s. Can only happen once every 3 seconds.",
    "Location": "Can be found in N'erud as a random world drop."
  },
  {
    "Tags": [
      "AOE",
      "ExplosiveDamage",
      "Exposed"
    ],
    "Name": "Echo Chamber",
    "Description": "Increases Explosive Damage by 10% and AOE Size by 25%. Inflicting Explosive Damage applies EXPOSED for 5s. Max 15s. EXPOSED: Target receives 15% additional damage from all sources.",
    "Location": "Complete the Upward Colisseum event in Athenaeum Wek (N'erud) without using the House Wek Command Orb.;Exclusive to The Dark Horizon DLC."
  },
  {
    "Tags": [
      "HeatReductionRate",
      "Overheat",
      "FireRate"
    ],
    "Name": "Exhaust Valve",
    "Description": "Increases Heat Decay Rate by 25% and Weapons that Generate Heat no longer Overheat. At Max Heat, Fire Rate is reduced by 20%.",
    "Location": "Can be found during the Noxious Gas Chamber Event. ;Exclusive to The Dark Horizon DLC."
  },
  {
    "Tags": [
      "LowHealth",
      "GreyHealth"
    ],
    "Name": "Hangman's Noose",
    "Description": "Restricts Health to 50% and backfills with permanent Grey Health. All incoming damage is fully converted into Grey Health and Grey Health cannot be removed.",
    "Location": "Can be found in Losomn as a random world drop."
  },
  {
    "Tags": [
      "OnPerfectDodge",
      "AllDamage",
      "DamageReduction"
    ],
    "Name": "Insipid Talon",
    "Description": "On Perfect Dodge, increases All Damage dealt by 2% and Damage Reduction by 1% for 10s. Max 15 stacks.",
    "Location": "Defeating the boss The One True King in Losomn without taking a single hit."
  },
  {
    "Tags": [
      "OnSkillUse",
      "AllDamage"
    ],
    "Name": "Ornate Amulet",
    "Description": "Activating a Skill increases All Damage by 5% for 10s. Max 5 stacks.",
    "Location": "Can be crafted at Spark, you will need the following Materials: x1 Ornate Lockbox and x50 Ancient Alloy"
  },
  {
    "Tags": [
      "Slide",
      "Reload"
    ],
    "Name": "Quantum Memory",
    "Description": "Combat Slide reloads currently equipped Firearm. Perfect Dodge Combat Slide reloads both firearms.",
    "Location": "N'erud - Detritus Foundry: take the descending elevator in the room where you find the Crop Sample."
  },
  {
    "Tags": [
      "ModDamage",
      "ModPower"
    ],
    "Name": "Reaction Chain",
    "Description": "Increases Mod Damage by 20%. Activating a Mod generates 50% of Mod Power Spent to the Stowed Weapon's Mod.",
    "Location": "A random world drop in N'Erud. (World drops are completely random and can appear anywhere in the world or its dungeons)"
  },
  {
    "Tags": [
      "OnSwap",
      "RangedDamage"
    ],
    "Name": "Relay Device",
    "Description": "Swapping Firearms increases Ranged Damage by 20% for 1.5s plus an additional 0.5s for each round in the Magazine. Max 15s.",
    "Location": "Can be found in a dead body, in a small area in the Withered Necropolis."
  },
  {
    "Tags": [
      "Shield",
      "CriticalChance",
      "CriticalDamage",
      "SkillCooldown"
    ],
    "Name": "Short Circuit",
    "Description": "While a SHIELD is active, increases Critical Chance and Critical Damage by 10% and Skill Cooldowns are reduced by 6% once every 5s.",
    "Location": "Shortly after entering the Mucid Terrarium or the Logistics Bridge, you may come across a sealed door with a broken circuit wire to the right of it. Shoot the wire with the Enigma and the door will begin to open. After entering the room, clear out the enemies and to the right of the terrarium in the middle will be a wire hanging directly down, shoot this wire with the Enigma as well and it will begin to open the door directly opposite from where you entered. Be careful as there will be an elite enemy that will be behind the door. Once killing the elite, enter the room and to the left will be another wire, repeat the same steps as before and the left door in the terrarium room will begin to open. Once again there will be another elite that spawns behind the door, so be weary. After killing these final enemies, enter the room and collect the Combat Shield Generator ring. Then to the right of the door when facing the room, look up and charge the final wire and it will open the door directly opposite the side of the room you're on. Enter the final room upon a corpse will be the Short Circuit amulet for your collection."
  },
  {
    "Tags": [
      "StatusEffectDamage",
      "OnStatusApplied"
    ],
    "Name": "Timekeeper's Forfeit",
    "Description": "Increases Status Effect Damage by 50%. Applying a Status Effect to an enemy also applies it to the wearer.",
    "Location": "Can be crafted at Spark, you will need the following Materials: x1 Clockwork Pinion, x50 Mythril Alloy."
  },
  {
    "Tags": [
      "ExplosiveCritChance",
      "ExplosiveCritDamage",
      "Shield"
    ],
    "Name": "Volatile Cartridge",
    "Description": "Increases Explosive Critical Chance and Explosive Critical Damage by 1% for every 5% of Max Health protected by a SHIELD.",
    "Location": "Can be crafted at Spark, you will need the following Materials: x1 Override Pin and x50 Alien Alloy"
  },
  {
    "Tags": [
      "AllDamage",
      "CriticalChance",
      "Encumbrance"
    ],
    "Name": "Zero Hour",
    "Description": "Increases All Damage by 20% and Critical Chance by 10%. Each Weight Class above LIGHT reduces All Damage bonus by 5% and Critical Chance by 2.5%.",
    "Location": "Can be found in N'erud as a random world drop."
  },
  {
    "Tags": [
      "Bleeding",
      "CriticalChance",
      "CriticalDamage"
    ],
    "Name": "Abrasive Whetstone",
    "Description": "When attacking a BLEEDING enemy, Crit Chance and Crit Damage are increased by 15%.",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "AllDamage",
      "OnRelicUse"
    ],
    "Name": "Ankh of Power",
    "Description": "Grants a 15% increase to all damage. Consuming a Relic increases the bonus to 25% for 15s.",
    "Location": "Can be found in Root Earth - Ashen Wasteland."
  },
  {
    "Tags": [
      "StaminaRegen",
      "StaminaCost"
    ],
    "Name": "Broken Pocket Watch",
    "Description": "Increases Stamina Regeneration by 25 and reduces Stamina cost by 50%.",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "CriticalChance",
      "CriticalDamage",
      "OnChargedMelee"
    ],
    "Name": "Butcher's Fetish",
    "Description": "Increases Critical Chance by 15% and Critical Damage by 25% for 5s after striking enemy with a Charged Melee Attack.",
    "Location": "Can be bought from Reggie for 1,000  after completing the game on Veteran difficulty."
  },
  {
    "Tags": [
      "NegativeStatusEffect"
    ],
    "Name": "Chains Of Amplification",
    "Description": "Increases all damage dealt to targets suffering from a Status Effect by 20%.",
    "Location": "Can be found in Losomn, as a random world drop."
  },
  {
    "Tags": [
      "ElementalStatusEffect",
      "OnRelicUse",
      "TeamBuff"
    ],
    "Name": "Cleansing Stone",
    "Description": "Reduces Duration of Elemental Status Effects against wearer by 50%. Relic use cleanses Elemental Status effects and grants 25% of wearers Max Health to all allies within 20m when cleansed.",
    "Location": "Can be found in Losomn."
  },
  {
    "Tags": [
      "OnKill",
      "WeakspotDamage"
    ],
    "Name": "Core Booster",
    "Description": "Increases weakspot damage by 50% for 10s after killing an enemy.",
    "Location": "Can be found in N'Erud - Hidden underneath the Ascension Spire worldstone down a hole behind the first statue to your left when you enter. It will be behind a forcefield that needs to be opened using the Decorum Cipher or the Memory Core II."
  },
  {
    "Tags": [
      "AllDamage",
      "MovementSpeed"
    ],
    "Name": "Daredevil's Charm",
    "Description": "Gain 7.5% to all damage dealt and 3.75% Movement Speed for each piece of unequipped armor.",
    "Location": "Can be bought from Reggie after completing Root Earth in Hardcore mode on any difficulty."
  },
  {
    "Tags": [
      "AllDamage",
      "LowHealth",
      "Haste"
    ],
    "Name": "Death's Embrace",
    "Description": "Gain 15% to all damage when Health is below 100%. Gain an additional 10% bonus damage and  HASTE when below 50% Health.",
    "Location": "Can be found in Yaesha ;Can be bought for Bedel of the Vaunnt for 400."
  },
  {
    "Tags": [
      "Lifesteal",
      "Melee",
      "LowHealth",
      "MaxHealth",
      "MeleeDamage"
    ],
    "Name": "Decayed Margin",
    "Description": "Melee hits gain 3% base damage dealt as Lifesteal. For each 25% missing Health, gain 3% additional Melee Lifesteal. When Health is full, gain 35% Melee Damage.",
    "Location": "Can be bought from Cass."
  },
  {
    "Tags": [
      "ExplosiveDamage",
      "Burning"
    ],
    "Name": "Detonation Trigger",
    "Description": "Increases Explosion damage by 25%. Explosions apply 405 BURNING damage over 5s.",
    "Location": "Can be found in N'Erud - Pounding Piston Event."
  },
  {
    "Tags": [
      "Shield",
      "AllDamage",
      "Lifesteal"
    ],
    "Name": "Difference Engine",
    "Description": "While a SHIELD is active, All Damage is increased by 20%, and 4.5% of base damage dealt is returned as Lifesteal.",
    "Location": "Can be found in N'Erud -"
  },
  {
    "Tags": [
      "FireRate",
      "MeleeAttackSpeed",
      "LowHealth",
      "RangedDamage",
      "MeleeDamage"
    ],
    "Name": "Downward Spiral",
    "Description": "Increase Fire Rate by 10% and Melee Attack Speed by 15%. For every missing 10% of Max Health, gain 4% Ranged Damage (Max 20%) and 5% Melee Damage (Max 25%).",
    "Location": "Can be found in Yaesha - The Chimney"
  },
  {
    "Tags": [
      "GreyHealth",
      "AllDamage",
      "DamageReduction"
    ],
    "Name": "Effigy Pendant",
    "Description": "While Grey Health is present, gain 15% to all damage dealt, 10% damage reduction and 1 additional hit before Grey Health is removed.",
    "Location": "Can be found in Losomn - Secret passage in Cotton's Kiln or Butcher's Quarter."
  },
  {
    "Tags": [
      "AcidDamage",
      "CorrodedDamage"
    ],
    "Name": "Effluvium Enhancer",
    "Description": "Increases ACID damage by 25% and CORROSIVE damage by 50%.",
    "Location": "Can be found in N'Erud - Can be bought from the Drzyr Replicator."
  },
  {
    "Tags": [
      "LowHealth",
      "RelicUseChance"
    ],
    "Name": "Emergency Switch",
    "Description": "When below 50% health, chance to consume Relic on use is reduced by 50%. Final Relic Charge is not consumed on use, but effect cannot be triggered again for 30s.",
    "Location": "Can be found in N'Erud -"
  },
  {
    "Tags": [
      "StatusEffectDamage",
      "Explosive"
    ],
    "Name": "Energized Neck Coil",
    "Description": "Increases Status Effect damage by 20%. Applying a damaging Status Effect creates a 3m Explosion for 20% of the Status Effect's full damage.",
    "Location": "Can be found in The Labyrinth."
  },
  {
    "Tags": [
      "Shield",
      "CriticalChance",
      "AllDamage"
    ],
    "Name": "Energy Diverter",
    "Description": "While a SHIELD is active, gain 10% Critical Chance and 15% to all damage dealt.",
    "Location": "Can be found in N'Erud - Can be bought from the Drzyr Replicator underneath Ascension Spire."
  },
  {
    "Tags": [
      "ALlDamage",
      "OnKill"
    ],
    "Name": "Escalation Protocol",
    "Description": "Increases all damage dealt by 2.5% for 10s after killing an enemy. Stacks 10x. Dealing damage refreshes the timer.",
    "Location": "Can be found in Root Earth - Corrupted Harbor."
  },
  {
    "Tags": [
      "Lifesteal",
      "MaxHealth"
    ],
    "Name": "Full Moon Circlet",
    "Description": "Ranged damage gives Lifesteal as 3% of base damage dealt. At full health, damage is increased by 25%.",
    "Location": "Can be found in Yaesha - The Imperial Gardens, in a hidden room below a trapdoor marked with a golden full moon crest during a Blood Moon."
  },
  {
    "Tags": [
      "ModDamage",
      "OnModUse",
      "Haste"
    ],
    "Name": "Golden Ribbon",
    "Description": "Increases Mod damage by 25%. Activating a MOD grants HASTE for 15s.",
    "Location": "Complete The Statues Event in Council Chamber or Gilded Chambers in Losomn."
  },
  {
    "Tags": [
      "Reload"
    ],
    "Name": "Gunfire Security Lanyard",
    "Description": "Automatically reloads Magazine over time. Does not work for single shot weapons.",
    "Location": "Can be found in the Labyrinth Backrooms, in The Labyrinth"
  },
  {
    "Tags": [
      "FireRate",
      "ReloadSpeed"
    ],
    "Name": "Gunslinger's Charm",
    "Description": "Increases Fire Rate by 15% and Reload Speed by 25%.",
    "Location": "Ward 13: Talk to Mudtooth and ask him about his stories, repeat this multiple times (about 10 stories). Eventually Mudtooth will be thankful for your time and reward you with the Gunslinger's Ring. Keep playing the game, until you complete the second world. Go back to Mudtooth and repeat the process until he rewards you with the Gunslinger's Charm."
  },
  {
    "Tags": [
      "MeleeDamage"
    ],
    "Name": "Hallowed Egg",
    "Description": "Spending at least 30% of Firearms magazine to deal damage increases Melee damage by 10% for 7s. Stacks 5x.",
    "Location": "Can be found in Yaesha - Obtained after defeating Root Nexus."
  },
  {
    "Tags": [
      "SkillCharges",
      "HeavyWeapon",
      "SkillCooldown"
    ],
    "Name": "Hyperconductor",
    "Description": "Gain double Skill Charges. Increases Skill Cooldowns by 25%For Heavy Weapons, doubles Heavy Weapon Ammo instead.",
    "Location": "Can be found in N'Erud - The Train Event."
  },
  {
    "Tags": [
      "OnDamageReceived",
      "AllDamage",
      "DamageReduction"
    ],
    "Name": "Indignant Fetish",
    "Description": "Taking damage increases all damage dealt by 20% and reduces all incoming damage by 10%. Lasts 15s.",
    "Location": "Can be found in Losomn, as a random world drop."
  },
  {
    "Tags": [
      "FireRate",
      "ReloadSpeed",
      "Recoil"
    ],
    "Name": "Inert Overcharger",
    "Description": "Standing still for 0.5s increases Fire Rate by 20%, Reload Speed by 15%, and reduces Recoil by 50%. Lasts 2s after moving.",
    "Location": "Can be found in N'Erud, as a random world drop."
  },
  {
    "Tags": [
      "Bulwark",
      "AllDamage",
      "Haste"
    ],
    "Name": "Insulation Driver",
    "Description": "While BULWARK is active, gain 15% to all damage dealt and HASTE.",
    "Location": "Can be found in N'Erud -"
  },
  {
    "Tags": [
      "ModCastSpeed",
      "SkillCastSpeed",
      "AllDamage"
    ],
    "Name": "Jester's Bell",
    "Description": "Increases Mod and Skill Cast Speed by 35%. Casting a Skill or Mod increases all damage by 15% for 20s.",
    "Location": "Can be found in Losomn -"
  },
  {
    "Tags": [
      "Shield",
      "ModDamage",
      "ModPower"
    ],
    "Name": "Kinetic Shield Exchanger",
    "Description": "While a SHIELD is active, gain 25% Mod damage and generate 30% additional Mod power.",
    "Location": "Can be found in N'Erud -"
  },
  {
    "Tags": [
      "LowHealth",
      "RelicUseSpeed",
      "RelicUseChance"
    ],
    "Name": "Kuri Kuri Charm",
    "Description": "For every 10% of Health missing (Max 50%), gain 10% increased Relic Use Speed and 7% chance to not consume a Relic Charge.",
    "Location": "Can be found in Yaesha - Bird's Nest."
  },
  {
    "Tags": [
      "ModDuration",
      "ModCost"
    ],
    "Name": "Laemir Censer",
    "Description": "Increases Mod Duration by 50%. Increases Mod Cost by 10%.",
    "Location": "Can be found in Yaesha - Forgotten Field. Given to the player by The Laemir after exhausting every dialogue option."
  },
  {
    "Tags": [
      "Encumbrance",
      "StaminaCost"
    ],
    "Name": "Leto's Amulet",
    "Description": "Reduces Encumbrance by 40% and Stamina Cost by 35%.",
    "Location": "Can be purchased from Reggie after doing 100 flops."
  },
  {
    "Tags": [
      "MeleeDamage",
      "StaminaRegen"
    ],
    "Name": "Matriarch's Insignia",
    "Description": "Increases Melee Damage by 35% and causes all successful Melee Attacks to restore 10 Stamina.",
    "Location": "Can be found in Yaesha -"
  },
  {
    "Tags": [
      "Health",
      "Stamina",
      "Encumbrance"
    ],
    "Name": "Navigator's Pendant",
    "Description": "Grants 25 Health, 25 Stamina, and -10 Armor Encumbrance.",
    "Location": "Can be found in N'Erud - Obtained by wearing Rusted Navigator's Pendant and being eaten by Tal'Ratha."
  },
  {
    "Tags": [
      "StatusEffectDamage",
      "AllDamage"
    ],
    "Name": "Neckbone Necklace",
    "Description": "Reduces the Damage of Status Effects applied to wearer by 50%. Gain 25% increased Damage when suffering from a Status Effect or Blight.",
    "Location": "Complete The Feast Event in Losomn"
  },
  {
    "Tags": [
      "GreyHealth",
      "ModPower"
    ],
    "Name": "Necklace of Flowing Life",
    "Description": "Increases Grey Health conversion by an additional 100%. When Grey Health Conversion triggers, gain 5x the amount as Mod Power.",
    "Location": "Can be found in Yaesha, in a random dungeon. Hidden in a room behind an illusory wall."
  },
  {
    "Tags": [
      "AllDamage",
      "MaxHealth"
    ],
    "Name": "Necklace of Supremacy",
    "Description": "After 5s of not being damaged, increases all damage dealt by 15%. Increases to 30% if Health is full.",
    "Location": "Can be found in Yaesha - Forgotten Field. Rewarded to the player after killing The Laemir Root Nexus boss before killing any enemies it summons."
  },
  {
    "Tags": [
      "Lifesteal",
      "Healing"
    ],
    "Name": "Nightmare Spiral",
    "Description": " Gain 10% of base Ranged damage dealt as Lifesteal. Reduces Healing Effectiveness by 95%.",
    "Location": "Can be bought from Reggie after defeating all bosses (mini and world) once."
  },
  {
    "Tags": [
      "NegativeStatusEffect",
      "CriticalChance",
      "Haste",
      "OnEnemyProximity"
    ],
    "Name": "Nightweaver's Grudge",
    "Description": "Gain 15% Critical Chance and HASTE when within 20m of an entity suffering from a Status Effect.",
    "Location": "Can be obtained in Losomn - The Tormented Asylum. Given to the player by feeding Kolket's Razor to the Nightweaver's Web."
  },
  {
    "Tags": [
      "Healing",
      "Haste"
    ],
    "Name": "Nimue's Ribbon",
    "Description": "Increase Relic Healing Effectiveness by 50% Activating a Relic grants HASTE for 25s.",
    "Location": "Can be crafted in Losomn - Nimue's Retreat by Nimue."
  },
  {
    "Tags": [
      "ModDamage",
      "ModPower"
    ],
    "Name": "One True King Sigil",
    "Description": "Increases Mod damage by 20%. Enhances the effect of Faerin's Sigil and Faelin's Sigil by 50% per Sigil equipped.",
    "Location": "Can be crafted in Losomn - Nimue's Retreat by Nimue."
  },
  {
    "Tags": [
      "StaminaCost",
      "CriticalChance"
    ],
    "Name": "One-Eyed Joker Idol",
    "Description": "Neutral Backdash creates a Magic Card lasting 1s. If Card absorbs enemy damage gain 25% Critical Chance for 5s. Neutral Backdash cost 15 additional Stamina.",
    "Location": "Can be obtained by following the Joker card during the card Events."
  },
  {
    "Tags": [
      "RangedDamage"
    ],
    "Name": "Onyx Pendulum",
    "Description": "Firearm damage adds stacks which increase the damage of stowed firearm by 1.02x for 15s. Stacks 10 times (1.2x damage).",
    "Location": "Can be bought from Reggie after completing the Campaign on Nightmare difficulty."
  },
  {
    "Tags": [
      "OnKill",
      "RangedDamage",
      "Range"
    ],
    "Name": "Range Finder",
    "Description": "After killing an enemy, gain 10% Ranged damage and 2m Firearm Range. Stacks 3x Lasts 10s. Ranged Weakspot Hits will refresh duration.",
    "Location": "Can be found in N'Erud - Can be bought from the Drzyr Replicator."
  },
  {
    "Tags": [
      "Bleeding",
      "AllDamage",
      "LowEnemyHealth"
    ],
    "Name": "Ravager's Mark",
    "Description": "Increases all damage dealt to BLEEDING targets by 20%. Bonus increases to 30% for targets with 50% or lower Health.",
    "Location": "Can be obtained in Yaesha - Ravager's Lair. Given to the player by the Ravager after killing The Doe."
  },
  {
    "Tags": [
      "RelicHealingEfficacy",
      "LowHealth"
    ],
    "Name": "Red Doe Sigil",
    "Description": "Increases Relic Healing Effectiveness by 30% which doubles when the wearer's Health is below 50%.",
    "Location": "Can be found in Yaesha - Red Throne. Given to the player by The Eternal Empress for giving her the Ornate Lockbox without opening it."
  },
  {
    "Tags": [
      "Health",
      "Stamina",
      "Encumbrance"
    ],
    "Name": "Rusted Navigator's Pendant",
    "Description": "Grants 20 Health, 20 Stamina, and -15 Armor Encumbrance.",
    "Location": "Can be found in N'Erud - Astropath's Respite, in control room before you step into the pod."
  },
  {
    "Tags": [
    ],
    "Name": "Samoflange",
    "Description": "Direct damage taken from enemies, and any additional damage within 5s, is reduced by 60%. Once the defensive buff expires, all incoming damage to wearer is increased by 15% for 10s.",
    "Location": "Can be found in N'Erud - Tower of the Unseen."
  },
  {
    "Tags": [
      "Scrap"
    ],
    "Name": "Scavenger's Bauble",
    "Description": "Increases Scrap pickups by 50%, Automatically pick up any nearby crafting materials.",
    "Location": "Can be found in Yaesha -"
  },
  {
    "Tags": [
      "PhysicalDamage",
      "ElementalDamage"
    ],
    "Name": "Shaed Bloom Crystal",
    "Description": "Gain a 35% damage bonus. Every 5s, the bonus switches between Physical and Elemental damage.",
    "Location": "Can be found in Losomn - Malefic Palace."
  },
  {
    "Tags": [
      "ShockDamage",
      "OverloadedDamage"
    ],
    "Name": "Shock Device",
    "Description": "Increases SHOCK damage by 25% and OVERLOADED damage by 50%.",
    "Location": "Can be found behind a hidden passage at the bottom floor of the asylum in Losomn - Morrow Parish."
  },
  {
    "Tags": [
      "SkillDamage",
      "OnSkillUse",
      "Haste"
    ],
    "Name": "Silver Ribbon",
    "Description": "Increases Skill damage by 25%. Activating a SKILL grants HASTE for 15s.",
    "Location": "Complete The Statues Event in Shattered Gallery or The Great Hall in Losomn."
  },
  {
    "Tags": [
      "AllDamage",
      "Summons"
    ],
    "Name": "Soul Anchor",
    "Description": "Increases all damage dealt by 20% if at least 1 summon is active.",
    "Location": "Can be crafted in Yaesha at the Bloodmoon Altar. "
  },
  {
    "Tags": [
      "OnModUse",
      "SkillCooldown"
    ],
    "Name": "Spirit Wisp Amulet",
    "Description": "Activating a Mod reduces current Skill Cooldowns by 3% for every 300 Mod Power spent.",
    "Location": "Complete the Man in the Sewers event in Losomn."
  },
  {
    "Tags": [
      "RangedDamage",
      "MeleeDamage",
      "EnemyAwareness"
    ],
    "Name": "Stalker's Brand",
    "Description": "Gain 12.5% Ranged and 15% Melee damage. Bonus double versus enemies not targeting wearer.",
    "Location": "Can be found in Yaesha as a random drop."
  },
  {
    "Tags": [
      "FireDamage",
      "BurningDamage"
    ],
    "Name": "Talisman of the Sun",
    "Description": "Increases FIRE damage by 25% and BURNING damage by 50%.",
    "Location": "Can be found in Yaesha as a random drop."
  },
  {
    "Tags": [
      "OnSwap",
      "Acid",
      "Aura",
      "Corroded"
    ],
    "Name": "Toxic Release Valve",
    "Description": "Swapping off a Firearm releases a Toxic Cloud, which deals 148.5 ACID Damage to all enemies within 7m. and applies CORROSION. Can only happen once every 3s.",
    "Location": "Can be found in N'Erud - Dormant N'erudian Facility in the room unlocked using the Biome-Control Glyph."
  },
  {
    "Tags": [
      "Armor",
      "Encumbrance"
    ],
    "Name": "Twisted Idol",
    "Description": "Increases Armor Effectiveness by 35% and reduces Encumbrance by 20.",
    "Location": "Can be bought from Cass at Ward 13."
  },
  {
    "Tags": [
      "AllDamage",
      "LowHealth"
    ],
    "Name": "Vengeance Idol",
    "Description": "Increases all damage dealt by 30% when the wearer's Health is below 50%.",
    "Location": "Can be found in Yaesha -"
  },
  {
    "Tags": [
      "ReloadSpeed",
      "Reload"
    ],
    "Name": "Void Idol",
    "Description": "Increases Reload Speed by 30%. Reloads only require 50% of magazine from reserves to fully reload.",
    "Location": "N'Erud - Can be crafted at Drzyr Replicator but only if you have the Shining Essence Echo material. "
  },
  {
    "Tags": [
      "Encumbrance",
      "MovementSpeed",
      "StaminaCost"
    ],
    "Name": "Weightless Weight",
    "Description": "Increases Movement Speed by 0.75% and Reduces Stamina Costs of all actions by 0.75%  for every each 5 point of Armor Encumbrance.",
    "Location": "Can be found in Losomn, as a random world drop."
  },
  {
    "Tags": [
      "AllDamage",
      "OnEnemyProximity",
      "NegativeStatusEffect"
    ],
    "Name": "Death Soaked Idol",
    "Description": "Increases All Damage by 6% for each entity within 20m suffering from a unique Negative Status Effect. Max 5 stacks.",
    "Location": "Can be found by completing the Ethereal Manor Event.;Exclusive to The Awakened King DLC"
  },
  {
    "Tags": [
      "OnStaminaUse",
      "CriticalChance"
    ],
    "Name": "Gift Of Euphoria",
    "Description": "Spending 20 Stamina grants 5% Critical Chance for 5s. Max 5 stacks.",
    "Location": "Can be found in Walk of Remembrance.;Exclusive to The Awakened King DLC"
  },
  {
    "Tags": [
      "ModWeakspotDamage",
      "SkillWeakspotDamage"
    ],
    "Name": "Index Of The Scribe",
    "Description": "Increases Mod and Skill Weakspot Damage by 35%",
    "Location": "Can be bought from Leywise in Forlorn Coast;Exclusive to The Awakened King DLC"
  },
  {
    "Tags": [
      "MovementSpeed"
    ],
    "Name": "Gift Of The Unbound",
    "Description": "Disables negative effects of Burden Rings. Gain 5% movement Speed per Burden lifted (max 20%).",
    "Location": "Can be found in Forlorn Coast;Exclusive to The Awakened King DLC"
  },
  {
    "Tags": [
      "AllDamage",
      "Exposed",
      "OnPerfectDodge"
    ],
    "Name": "Birthright of the Lost",
    "Description": " Increases All Damage dealt by 10%. On perfect dodge, apply EXPOSED on the attacker and enemies within 3m of the wearer for 15s. EXPOSED: Target receives up to 15% additional damage from all sources. ",
    "Location": "Random world drop in Losomn;Exclusive to The Awakened King DLC"
  },
  {
    "Tags": [
      "ConcoctionLimit",
      "DamageReduction"
    ],
    "Name": "Brewmasters Cork",
    "Description": " Increases active Concoction limit by 2 and reduces all incoming damage by 2% for each active Concoction ",
    "Location": "Random world drop in Losomn;Exclusive to The Awakened King DLC"
  },
  {
    "Tags": [
      "RelicCapacity",
      "AllDamage"
    ],
    "Name": "Cost of Betrayal",
    "Description": " Reduces Max Relic Charges to 1. Increases All Damage by 25% when wearer has 1 Relic Charge. Increases incoming damage by 25% when wearer has no Relic Charges and after 15s, regain 1 Relic Charge. ",
    "Location": "Before The One True King's throne room, you will find the three former counsels dead. Shoot their bodies and one of them will drop this item.;Exclusive to The Awakened King DLC"
  },
  {
    "Tags": [
      "AllDamage",
      "MaxStamina"
    ],
    "Name": "Gift of Melancholy",
    "Description": "Increases All Damage dealt by 25% when Stamina is at 100% for 7s.",
    "Location": "Use the Memoriam Medallion Key to open a door in the maze in Pathway of the Fallen to find it.;Exclusive to The Awakened King DLC."
  },
  {
    "Tags": [
      "SkillCooldown",
      "SkillDuration"
    ],
    "Name": "Legacy Protocol",
    "Description": " Lowers skill cooldown by 30% and increased skill duration by 25% ",
    "Location": "Random loot in N'erud;Exclusive to The Awakened King DLC"
  },
  {
    "Tags": [
      "Health",
      "Stamina",
      "MovementSpeed",
      "DamageReduction"
    ],
    "Name": "Participation Medal",
    "Description": "Increase Health by 10%, Stamina by 10%, Movement Speed by 10%, and Damage Reduction by 10%",
    "Location": "Die when facing any boss while the difficulty is set on Apocalypse.;Exclusive to The Awakened King DLC"
  },
  {
    "Tags": [
      "NegativeStatusEffect",
      "StatusEffectDamage"
    ],
    "Name": "Sinister Totem",
    "Description": " Applying or refreshing a Negative Status Effect to an enemy increases Status Damage by 1% for 15s. Max 50 stacks. ",
    "Location": "Random loot in The Forbidden Grove - Yaesha;Exclusive to The Awakened King DLC"
  },
  {
    "Tags": [
      "Bulwark",
      "AllDamage"
    ],
    "Name": "Whispering Marble",
    "Description": "Gain 3 stacks of BULWARK. Increase damage by 2% per stack of BULWARK",
    "Location": "Losomn - random world drop;Exclusive to The Awakened King DLC"
  },
  {
    "Tags": [
      "ReloadSpeed",
      "RangedDamage"
    ],
    "Name": "Moon Stone",
    "Description": "Increases reload speed by 15%. Every third manual Reload will reload both Firearms and increases Ranged Damage by 15% for 10s",
    "Location": "Fall in a specific tile while completing the Moon Puzzle in Yaesha;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "DamageReduction",
      "MovementSpeed",
      "LowHealth"
    ],
    "Name": "Beads of the Valorous",
    "Description": "Increases Damage Reduction and Movement Speed by 1% for every 5% of missing Max Health. Bonus is doubled at or below 50% Max Health. Max 10 stacks.",
    "Location": " Random world drop, Luminous Vale Area (Yaesha) ;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "OnRelicUse",
      "RelicCapacity"
    ],
    "Name": "Echo of the Forest",
    "Description": "On Relic use, gain GIFT OF THE FOREST for 15s. When Gift of the Forest expires, Relic effect is recast",
    "Location": "In the DLC area, head to Luminous Vale, There’s a random drop in this area called Trinity Stones. Each playthrough you can get one. After getting each piece, head to Dwell and give him three pieces, and all of the pieces will turn into the Amulet.;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "NegativeStatusEffect",
      "StatusEffectDamage",
      "Exposed"
    ],
    "Name": "Fragrant Thorn",
    "Description": " Increases Status Effect Damage by 20%. Inflicting 4 or more unique Negative Status Effects on a target applies EXPOSED for 15s. EXPOSED: Target receives 15% additional damage from all sources. ",
    "Location": "Random world drop, Ancient Canopy, Yaesha.;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
      "Summons",

    ],
    "Name": "Profane Soul Stone",
    "Description": "Increases Summons Damage by 30% and Summon Movement Speed by 15%. Reduces Damage Reduction by 10% per active Summon",
    "Location": "Generate the Dungeon Infected Abyss, find the boss The Emissary, and tell him you want to serve under him. He will give you this amulet;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
    ],
    "Name": "Stoneshaper's Chisel",
    "Description": "After not using the primary fire of weapon for 10s, All Damage is increased by 25%. Primary fire of a weapon instantly cancels the effect",
    "Location": "After being curse by Lydusa, head to the Ancient Canopy Area, find the living statue and exhaust all of its dialogue, and it will turn into this amulet.;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
    ],
    "Name": "Worn Dog Tags",
    "Description": "Increases Fire Rate and Reload Speed by 15% and Decreases Weapon Charge Time by 15%.",
    "Location": "Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
    ],
    "Name": "Cervine Keepsake",
    "Description": "On Relic Use, gain a stack of CALL OF THE DOE for 30s. Max 5 stacks.CALL OF THE DOE: Increases Movement Speed by 4% per stack. When CALL OF THE DOE expires, regain 1 Relic Charge per stack.",
    "Location": "Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
    ],
    "Name": "Magniflying Glass",
    "Description": "Increases Skill and Mod Duration by 30% and their AOE or Aura Sizes by 20%.",
    "Location": "Exclusive to The Forgotten Kingdom DLC.;Random world drop in Losomn"
  },
  {
    "Tags": [
    ],
    "Name": "Reed of the Vaunnt",
    "Description": "Activation a Mod increases Mod Generation by 15% for 10s. Mod Charges have 20% chance not to be consumed on use.",
    "Location": "Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
    ],
    "Name": "Soul Stone",
    "Description": " Increases Summons Damage by 30% and Summon Movement Speed by 30% ",
    "Location": "After you receive the Profane Soul Stone from The Emissary, head to the Labyrinth and talk to The Keeper while wearing the Profane Soul Stone. He will ask you to cleanse it, accept, and you will receive this Soul Stone for doing so.;Exclusive to The Forgotten Kingdom DLC."
  },
  {
    "Tags": [
    ],
    "Name": "Zero Divide",
    "Description": "Gain Infinite Ammo Reserves and Increases Ranged Damage by 15%",
    "Location": "Random drop. Found in Putrid Domain on N'Erud.;Exclusive to The Forgotten Kingdom DLC."
  }
]